Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-subsystem-code.po
Languages: es_mx, tr_tr

source: Writing the Code for a Subsystem
es_mx: Escribiendo el Código para un Subsistema
tr_tr: Subsystem-Alt Sistem için Kod Yazma

source: RobotBuilder has been updated to support the new commandbased framework! Unfortunately, this documentation is outdated and only for the old commandbased framework. Individuals interested in updating this documentation can open a pull request on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository.
es_mx: ¡RobotBuilder se ha actualizado para admitir el nuevo marco basado en comandos! Desafortunadamente, esta documentación está desactualizada y solo para el antiguo marco basado en comandos. Las personas interesadas en actualizar esta documentación pueden abrir una solicitud de extracción en el repositorio `frc-docs <https://github.com/wpilibsuite/frc-docs>`__.
tr_tr: RobotBuilder, yeni komut tabanlı çerçeveyi desteklemek için güncellendi! Ne yazık ki, bu dokümantasyon güncelliğini yitirmiştir ve yalnızca eski komut temelli çerçeve içindir. Bu dokümantasyonu güncellemekle ilgilenen kişiler, `frc-docs <https://github.com/wpilibsuite/frc-docs>`__deposuna destekte bulunabilirler.

source: Adding code to create an actual working subsystem is very straightforward. For simple subsystems that don't use feedback it turns out to be extremely simple. In this section we will look at an example of a Claw subsystem that operates the motor for some amount of time to open or close a claw on the robot arm.
es_mx: Añadir un código para crear un subsistema de trabajo es muy sencillo. Para los subsistema simples que no usan retroalimentación resulta ser extremadamente simple. En esta sección veremos un ejemplo de un subsistema de una Garra que opera el motor durante algún tiempo para abrir o cerrar una garra en el brazo del robot.
tr_tr: Gerçek bir çalışan alt sistem oluşturmak için kod eklemek çok basittir. Geri bildirim kullanmayan basit alt sistemler için son derece basit olduğu ortaya çıkıyor. Bu bölümde, robot kolundaki bir pençeyi açmak veya kapatmak için motoru belirli bir süre çalıştıran bir Claw alt sistemi örneğine bakacağız.

source: RobotBuilder Representation of the Claw Subsystem
es_mx: Representación de RobotBuilder del Subsistema de la Garra
tr_tr: Claw Subsystem-Pençe Alt Sisteminin RobotBuilder Temsili

source: The claw at the end of a robot arm is a subsystem operated by a single Victor speed controller. There are three things we want the claw to do, start opening, start closing, and stop moving. This is the responsibility of the subsystem. The timing for opening and closing will be handled by a command later in this tutorial.
es_mx: La garra al final del brazo del robot es un subsistema operado por un único Victor Speed Controller o controlador de velocidad Víctor. Hay tres cosas que queremos que haga la garra, empezar a abrir, empezar a cerrar y dejar de moverse. Esa es la responsabilidad del subsistema. El tiempo de apertura y cierre se manejará por un comando más adelante en este tutorial.

source: Adding Subsystem Capabilities
es_mx: Añadiendo Capacidades del Subsistema
tr_tr: Subsystem-Alt Sistem Yetenekleri Ekleme

source: Add methods to the claw.java that will open, close, and stop the claw from moving. Those will be used by commands that actually operate the claw. The comments have been removed from this file to make it easier to see the changes for this document. Notice that a member variable called "victor" is created by RobotBuilder so it can be used throughout the subsystem. Each of your dragged-in palette items will have a member variable with the name given in RobotBuilder.
es_mx: Añada métodos a garra.java que abran, cierren y detengan el movimiento de la garra. Esos métodos serán utilizados por los comandos que realmente operan la garra. Los comentarios han sido eliminados de este archivo para que sea más fácil ver los cambios del documento. Note que una variable llamada "victor" es creada por RobotBuilder para que pueda ser usada en todo el subsistema. Cada uno de los elementos de su paleta arrastrada tendrá una variable miembro con el nombre dado en RobotBuilder.
tr_tr: Claw.java'ya pençeyi açacak, kapatacak ve hareketini durduracak yöntemler ekleyin. Bunlar, pençeyi gerçekten çalıştıran komutlar tarafından kullanılacaktır. Bu belgedeki değişiklikleri görmeyi kolaylaştırmak için yorumlar bu dosyadan kaldırılmıştır. "Victor" adlı bir üye değişkenin RobotBuilder tarafından yaratıldığına dikkat edin, böylece alt sistemde kullanılabilir. Sürüklenen palet öğelerinizin her biri, RobotBuilder'da verilen ada sahip bir üye değişkenine sahip olacaktır.

source: Adding the Method Declarations to the Header File (C++ Only)
es_mx: Añadir las Declaraciones del Método al Archivo de Cabecera (Sólo C++)
tr_tr: Üstbilgi Dosyasına Yöntem Bildirimleri Ekleme (Yalnızca C ++)

source: In addition to adding the methods to the class implementation file, Claw.cpp, the declarations for the methods need to be added to the header file, Claw.h. Those declarations that must be added are shown here.
es_mx: Además de agregar los métodos al archivo de implementación de la clase Claw.cpp, las declaraciones para los métodos deben ser añadidos al archivo de cabecera, Claw.h. Las declaraciones que deben ser añadidas se muestran aquí.
tr_tr: Yöntemleri sınıf uygulama dosyasına Claw.cpp eklemeye ek olarak, yöntemlerin bildirimlerinin Claw.h başlık dosyasına eklenmesi gerekir. Eklenmesi gereken beyanlar burada gösterilmektedir.

source: To add the behavior to the claw subsystem to operate it to handle opening and closing you need to :doc:`define commands <../introduction/robotbuilder-creating-command>`.
es_mx: Para añadir el comportamiento al subsistema de la garra para operarlo para manejar la apertura y el cierre, usted necesita :doc:`definir los comandos <../introduction/robotbuilder-creating-command>`.
tr_tr: Açma ve kapama işlemlerini yürütmek üzere pençe alt sistemine davranış eklemek için şunları yapmanız gerekir :doc:`define commands <../introduction/robotbuilder-creating-command>`.

source: The claw at the end of a robot arm is a subsystem operated by a single Victor Motor Controller. There are three things we want the claw to do, start opening, start closing, and stop moving. This is the responsibility of the subsystem. The timing for opening and closing will be handled by a command later in this tutorial.
tr_tr: Bir robot kolunun ucundaki pençe, tek bir Victor Motor Kontrol Cihazı tarafından çalıştırılan bir alt sistemdir. Pençenin yapmasını istediğimiz üç şey var, açmaya başla, kapatmaya başla ve hareket etmeyi bırak. Bu, alt sistemin sorumluluğundadır. Açma ve kapama zamanlaması, bu eğitimin ilerleyen bölümlerinde bir komutla ele alınacaktır.
