Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-command-code.po
Languages: es_mx, fr_ca, tr_tr

source: Writing the Code for a Command
es_mx: Escribiendo el Código para un Comando
fr_ca: Écrire le code d'une commande
tr_tr: Bir Komutun Kodunu Yazmak

source: RobotBuilder has been updated to support the new commandbased framework! Unfortunately, this documentation is outdated and only for the old commandbased framework. Individuals interested in updating this documentation can open a pull request on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository.
tr_tr: RobotBuilder, yeni komut tabanlı çerçeveyi desteklemek için güncellendi! Ne yazık ki, bu dokümantasyon güncelliğini yitirmiştir ve yalnızca eski komut temelli çerçeve içindir. Bu dokümantasyonu güncellemekle ilgilenen kişiler, "frc-docs <https://github.com/wpilibsuite/frc-docs>" __ deposuna destekte bulunabilirler.

source: Subsystem classes get the mechanisms on your robot moving, but to get it to stop at the right time and sequence through more complex operations you write Commands. Previously in :doc:`writing the code for a subsystem <robotbuilder-writing-subsystem-code>` we developed the code for the Claw subsystem on a robot to start the claw opening, closing, or to stop moving. Now we will write the code for a command that will actually run the Claw motor for the right time to get the claw to open and close. Our claw example is a very simple mechanism where we run the motor for 1 second to open it or 0.9 seconds to close it.
es_mx: Las clases del subsistema hacen que los mecanismos de tu robot se muevan, pero para que se detenga en el momento correcto y la secuencia a través de operaciones más complejas, escriba comandos. Anteriormente en :doc:`Escribiendo el Código para un Subsistema <robotbuilder-writing-subsystem-code>` desarrollamos el código para un comando que hará funcionar el motor de la garra en el momento adecuado para que la garra se abra y se cierre. Nuestro ejemplo de la garra es un mecanismo muy simple en el que hacemos funcionar el motor durante 1 segundo para abrir o 0.9 segundos para cerrarlo.
fr_ca: Les classes de sous-système font bouger les mécanismes de votre robot, mais pour qu'il s'arrête au bon moment et enchaîne des opérations plus complexes, vous écrivez des commandes. Précédemment dans :doc:`écrire le code d'un sous-système<robotbuilder-writing-subsystem-code>` nous avons développé le code du sous-système Claw sur un robot pour démarrer l'ouverture, la fermeture ou arrêter le déplacement de la griffe. Nous allons maintenant écrire le code d'une commande qui exécutera le moteur Claw pendant le bon moment pour ouvrir et fermer la griffe. Notre exemple de griffe est un mécanisme très simple où nous faisons tourner le moteur pendant 1 seconde pour l'ouvrir ou 0,9 seconde pour le fermer.
tr_tr: Alt sistem sınıfları, robotunuzdaki mekanizmaları hareket ettirir, ancak doğru zamanda durmasını ve daha karmaşık işlemlerle sıralanmasını sağlamak için Komutlar yazarsınız. Daha önce :doc:`writing the code for a subsystem<robotbuilder-writing-subsystem-code>` pençe açmayı, kapatmayı veya hareketi durdurmayı başlatmak için bir robot üzerindeki Claw alt sisteminin kodunu geliştirdik. Şimdi pençenin açılıp kapanmasını sağlamak için Claw motorunu doğru zamanda çalıştıracak bir komutun kodunu yazacağız. Pençe örneğimiz, motoru açmak için 1 saniye veya kapatmak için 0,9 saniye çalıştırdığımız çok basit bir mekanizmadır.

source: Closeclaw Command in RobotBuilder
es_mx: Comando Closeclaw en RobotBuilder
fr_ca: Commande Closeclaw dans RobotBuilder
tr_tr: RobotBuilder'da Closeclaw Komutu

source: This is the definition of the Closeclaw command in RobotBuilder. Notice that it requires the Claw subsystem. This is explained in the next step.
es_mx: Esta es la definición del comando Closeclaw en RobotBuilder. Note que eso requiere el subsistema de la garra. Esto es explicado en el siguiente paso.
fr_ca: Il s'agit de la définition de la commande Closeclaw dans RobotBuilder. Notez qu'elle nécessite le sous-système Claw. Ceci est expliqué à l'étape suivante.
tr_tr: Bu, RobotBuilder'daki Closeclaw komutunun tanımıdır. Claw alt sistemini gerektirdiğine dikkat edin. Bu, sonraki adımda açıklanmaktadır.

source: Generated Closeclaw Class
es_mx: Clase Closeclaw Generada
fr_ca: Classe Closeclaw générée
tr_tr: Oluşturulan Closeclaw Sınıfı

source: RobotBuilder will generate the class files for the Closeclaw command. The command represents the behavior of the claw, that is the operation over time. To operate this very simple claw mechanism the motor needs to operate for 1 second in the close direction. The Claw subsystem has methods to start the motor running in the right direction and to stop it. The commands responsibility is to run the motor for the correct time. The lines of code that are shown in the boxes are added to add this behavior.
es_mx: RobotBuilder generará los archivos de clase para el comando CloseClaw. El comando regresa el comportamiento de la garra, es decir, la operación a lo largo del tiempo. Para operar este simple mecanismo de la garra, el motor necesita funcionar durante 1 segundo en la dirección cercana. El subsistema de la garra tiene métodos para poner en marcha el motor en la dirección correcta y para detenerlo. La responsabilidad de los comandos es hacer funcionar el motor en el momento correcto. Las líneas de código que son mostradas en los cuadros se añaden para añadir este comportamiento.
fr_ca: RobotBuilder générera les fichiers de classe pour la commande Closeclaw. La commande représente le comportement de la pince, c'est-à-dire son opération dans le temps. Pour faire fonctionner ce mécanisme de pince très simple, le moteur doit fonctionner pendant 1 seconde dans la direction de fermeture. Le sous-système Claw a les méthodes pour démarrer le moteur dans la bonne direction et pour l'arrêter. La responsabilité des commandes est de faire tourner le moteur pour le délai requis. Les lignes de code qui sont affichées dans les boîtes sont ajoutées pour créer ce comportement.
tr_tr: RobotBuilder, Closeclaw komutu için sınıf dosyalarını oluşturacaktır. Komut, pençe davranışını, yani zaman içindeki işlemi temsil eder. Bu çok basit tırnak mekanizmasını çalıştırmak için motorun yakın yönde 1 saniye çalışması gerekir. Pençe alt sistemi, motoru doğru yönde çalıştırma ve durdurma yöntemlerine sahiptir. Komutların sorumluluğu, motoru doğru zamanda çalıştırmaktır. Kutularda gösterilen kod satırları, bu davranışı eklemek için eklenir.

source: Set the one second timeout for this command. When the command is scheduled, a timer will be started so the one second operation can easily be tested.
es_mx: Establezca el tiempo de espera para este comando. Cuando el comando esté programado, un temporizador se iniciará para que la segunda operación pueda ser fácilmente probada.
fr_ca: Définir le délai d'une seconde pour cette commande. Lorsque la commande est planifiée, une minuterie sera lancée afin que l'opération qui va durer une seconde puisse être facilement testée.
tr_tr: Bu komut için bir saniyelik zaman aşımı ayarlayın. Komut programlandığında, bir saniyelik işlemin kolayca test edilebilmesi için bir zamanlayıcı başlatılacaktır.

source: Start the claw motor moving in the closing direction by calling the Close method that was added to the Claw subsystem.
es_mx: Inicie el movimiento del motor de la garra en la dirección del cierre llamando al método de cierre que se añadió al subsistema de la garra.
fr_ca: Démarrer le moteur qui controle la pince, pour qu'elle se déplaçe dans la direction de fermeture Ceci est accompli en appelant la méthode Close qui a été ajoutée au sous-système Claw.
tr_tr: Claw alt sistemine eklenen Close yöntemini çağırarak pençe motorunu kapanma yönünde hareket ettirin.

source: This command is finished when the timer runs out which happens after one second has passed. This is the timer set in step 1.
es_mx: Este comando se termina cuando el temporizador llegue a 0, lo que sucede cuando pasa un segundo. Esta es la configuración del temporizador del paso 1.
fr_ca: Cette commande est terminée lorsque la minuterie (définie à l'étape 1) atteint la valeur du délai, ce qui se produit après une seconde.
tr_tr: Bu komut, bir saniye geçtikten sonra zamanlayıcı bittiğinde biter. Bu, 1. adımda ayarlanan zamanlayıcıdır.

source: The ``End()`` method is called when the command is finished and is a place to clean up. In this case, the motor is stopped since the time has run out.
es_mx: El método ``End()`` se llama cuando el comando ha terminado. En este caso, el motor está parado desde que el tiempo se ha agotado.
fr_ca: La méthode ``End()`` est alors appelée lorsque la commande est terminée et c'est un moment idéal pour réinitialiser certaines variables et relâcher les ressources qui ne seront plus utilisées. Dans ce cas, on arrête le moteur car le temps est écoulé.
tr_tr: ``End()`` yöntemi, komut bittiğinde çağrılır ve temizlenecek bir yerdir. Bu durumda motor, süre dolduğu için durdurulur.

source: The ``Interrupted()`` method is called is this command is interrupted if another command that also requires the Claw subsystem is scheduled before this finishes. For example, if the Closeclaw command was scheduled and running, then the Openclaw command was scheduled it would interrupt the Openclaw command, call its Interrupted() method, and the motor would stop.
es_mx: El método ``Interrupted()`` es llamado si este comando es interrumpido por otro comando que también requiere que el subsistema de la garra esté programado antes de que esto termine. Por ejemplo, si el comando Closeclaw estaba programado y funcionando, luego el comando Openclaw estaba programado para ese momento, interrumpiría el comando Openclaw, y llamaría a su método Interrupted() y el motor se detendría.
fr_ca: La méthode ``Interrupted()`` est appelée si cette commande est interrompue parce qu'une autre commande nécessite également le sous-système Claw, et ceci, avant qu'elle se termine. Par exemple, si la commande Closeclaw est planifiée ET en cours d'exécution, et ensuite, la commande Openclaw est planifiée, elle va interrompre la commande Closeclaw, appelerait ainsi sa méthode ``Interrupted()``, et dans notre exemple, le moteur s'arrêterait.
tr_tr: ``Interrupted()`` yöntemi çağrılır, bu işlem tamamlanmadan önce Claw alt sistemini de gerektiren başka bir komut programlanırsa bu komut kesintiye uğrar. Örneğin, Closeclaw komutu programlandıysa ve çalışıyorsa, Openclaw komutu programlanmışsa, Openclaw komutunu kesecek, Interrupted () yöntemini çağıracak ve motor duracaktır.
