Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/frc-docs/style-guide.po
Languages: tr_tr

source: Style Guide
tr_tr: Biçim Rehberi

source: This document contains the various RST/Sphinx specific guidelines for the frc-docs project. For guidelines related to the various WPILib code projects, see `the WPILib Github <https://github.com/wpilibsuite/styleguide>`__
tr_tr: Bu belge, frc-docs projesi için çeşitli RST/Sphinx'e özgü yönergeleri içerir. Çeşitli WPILib kod projeleriyle ilgili yönergeler için bkz. `WPILib Github <https://github.com/wpilibsuite/styleguide>`__

source: Filenames
tr_tr: Dosya İsimleri

source: Use only lowercase alphanumeric characters and ``-`` (minus) symbol.
tr_tr: Yalnızca küçük alfanümerik karakterler ve ``-`` (eksi) sembolünü kullanın.

source: For documents that will have an identical software/hardware name, append "Hardware" or "Software" to the end of the document name. IE, ``ultrasonics-hardware.rst``
tr_tr: Yazılım / Donanım ile ilgili belgeler için, belge adının sonuna "Hardware" veya "Software" ekleyin. Örneğin, ``ultrasonik donanım.rst``

source: Suffix filenames with the ``.rst`` extension.
tr_tr: ``.Rst`` uzantısına sahip suffix dosya adları.

source: If you are having issues editing files with the ``.rst`` extension, the recommended text editor is `Notepad++ <https://notepad-plus-plus.org/>`__. Please make sure that `tabs are replaced with spaces <https://stackoverflow.com/questions/455037/convert-tabs-to-spaces-in-notepad>`__, and the space indentation is set to ``3``.
tr_tr: ``.Rst`` uzantısına sahip dosyaları düzenlerken sorun yaşıyorsanız, önerilen metin düzenleyicisi `Notepad++ <https://notepad-plus-plus.org/>`__ kullanın. Lütfen `sekmelerin boşluklarla değiştirildiğinden <https://stackoverflow.com/questions/455037/convert-tabs-to-spaces-in-notepad>` __ ve boşluk girintisinin ``3`` olarak ayarlandığından emin olun.

source: Page References
tr_tr: Sayfa Referansları

source: Pages references will be auto-generated based on the page filename and section title.
tr_tr: Sayfa referansları, sayfa dosya adı ve bölüm başlığına göre otomatik olarak oluşturulacaktır.

source: For example, given the following file ``contributing.rst`` and a section called ``Page References``, you would reference this by doing ``:ref:`contributing:Page References```
tr_tr: Örneğin, ``contributing.rst`` dosyası ve ``Page References`` adlı bir bölüm verildiğinde, buna ``:ref:`contributing:Page References``` yaparak referans alabilirsiniz.

source: Please note that document structure is preserved in references, with the root being the location of the ``conf.py`` file. To access documents in sub-folders, simply prepend the folder path before the filename. IE, ``:ref:`docs/software/sensors/ultrasonics-sensors:Ultrasonics - Sensors```
tr_tr: Belge yapısının referanslarda korunduğunu ve kökün ``conf.py`` dosyasının konumu olduğunu lütfen unutmayın. Alt klasörlerdeki belgelere erişmek için, klasör yolunu dosya adının önüne eklemeniz yeterlidir. Örneğin, ``:ref:`docs/software/sensors/ultrasonics-sensors:Ultrasonics - Sensors```

source: Text
tr_tr: Metin

source: All text content should be on the same line, if you need readability, use the word-wrap function of your editor.
tr_tr: Tüm metin içeriği aynı satırda olmalıdır, okunabilirliğe ihtiyacınız varsa, editörünüzün kelime kaydırma işlevini kullanın.

source: Use the following case for these terms:
tr_tr: Bu terimler için aşağıdaki örnekleri kullanın:

source: roboRIO (not RoboRIO, roboRio, or RoboRio)
tr_tr: roboRIO (RoboRIO, roboRio yada RoboRio değil)

source: LabVIEW (not labview or LabView)
tr_tr: LabVIEW (labview yada LabView değil)

source: Visual Studio Code (VS Code) (not vscode, VScode, vs code, etc)
tr_tr: Visual Studio Code (VS Code) (vscode, VScode, vs code, v.b. değil)

source: macOS (not Mac OS, Mac OSX, Mac OS X, Mac, Mac OS, etc.)
tr_tr: macOS (Mac OS, Mac OSX, Mac OS X, Mac, Mac OS, v.b. değil)

source: Use the ASCII character set for English text. For special characters (e.g. Greek symbols) use the `standard character entity sets <https://docutils.sourceforge.io/docs/ref/rst/definitions.html#character-entity-sets>`_.
tr_tr: İngilizce metin için ASCII karakter kümesini kullanın. Özel karakterler için (örneğin, Yunan sembolleri) `standart karakter kümelerini <https://docutils.sourceforge.io/docs/ref/rst/definitions.html#character-entity-sets>` _ kullanın.

source: Use ``.. math::`` for standalone equations and ``:math:`` for inline equations. A useful LaTeX equation cheat sheet can be found `here <https://www.reed.edu/academic_support/pdfs/qskills/latexcheatsheet.pdf>`_.
tr_tr: Bağımsız denklemler için ``.. math ::`` ve satır içi denklemler için ``: math:`` kullanın. Yararlı bir LaTeX denklem kısayol sayfası `şu adreste bulunabilir: <https://www.reed.edu/academic_support/pdfs/qskills/latexcheatsheet.pdf> `_.

source: Use literals for filenames, function, and variable names.
tr_tr: Dosya adları, foksiyon ve değişken adları için genel geçer değerleri kullanın.

source: Use of the registered trademarks *FIRST*\ |reg| and FRC\ |reg| should follow the Policy from `this page <https://www.firstinspires.org/brand>`__. Specifically, where possible (i.e. not nested inside other markup or in a document title), the first use of the trademarks should have the |reg| symbol and all instances of *FIRST* should be italicized. The |reg| symbol can be added by using ``.. include:: <isonum.txt>`` at the top of the document and then using ``*FIRST*\ |reg|`` or ``FRC\ |reg|``.
tr_tr: Tescilli ticari markaların kullanımı *FIRST* \ |reg| ve FRC\|reg| politikasını `şu sayfadan <https://www.firstinspires.org/brand>`__ takip etmelisiniz. Spesifik olarak, mümkün olduğunda (yani başka bir işaretlemenin içine veya bir belge başlığına yerleştirilmemişse), ticari markaların ilk kullanımında |reg| sembolü ve tüm *FIRST* yazı örnekleri italik yazılmalıdır. |Reg| sembolü, belgenin üst kısmındaki ``..include::<isonum.txt>`` kullanılarak ve ardından ``*FIRST*\| reg |`` veya ``FRC\|reg|`` kullanılarak eklenebilir .

source: Whitespace
tr_tr: Whitespace - Beyazboşluk

source: Indentation
tr_tr: Girinti

source: Indentation should *always* match the previous level of indentation *unless* you are creating a new content block.
tr_tr: Yeni bir içerik bloğu *oluşturmadığınız sürece* girinti *her zaman* önceki girinti düzeyiyle eşleşmelidir.

source: Indentation of content directives as new line ``.. toctree::`` should be `3` spaces.
tr_tr: İçerik direktiflerinin yeni satırının ``..toctree::`` olarak girintisi ``3`` boşluk olmalıdır.

source: Blank Lines
tr_tr: Boş Satırlar

source: There should be ``1`` blank lines separating basic text blocks and section titles. There *should* be ``1`` blank line separating text blocks *and* content directives.
tr_tr: Temel metin bloklarını ve bölüm başlıklarını ayıran ``1`` boş satır olmalıdır. Metin bloklarını *ve* içerik direktiflerini ayıran ``1`` boş satır *olmalıdır*.

source: Interior Whitespace
tr_tr: İç Beyazboşluk

source: Use one space between sentences.
tr_tr: Cümleler arasında bir boşluk kullanınız.

source: Headings
tr_tr: Başlıklar

source: Headings should be in the following structure. Heading underlines should match the same number of characters as the heading itself.
tr_tr: Başlıklar aşağıdaki yapıda olmalıdır. Başlık alt çizgileri, başlığın kendisiyle aynı sayıda karakterle eşleşmelidir.

source: ``=`` for document titles. *Do not* use this more than *once* per article.
tr_tr: Belge başlıkları için ``=``. Bunu makale başına * birden fazla * *kullanmayın*.

source: ``-`` for document sections
tr_tr: ``-`` doküman bölümleri için

source: ``^`` for document sub-sections
tr_tr: ``^`` alt doküman bölümleri için

source: ``~`` for document sub-sub-sections
tr_tr: ``~`` Doküman alt-alt bölümleri için

source: If you need to use any lower levels of structure, you're doing things wrong.
tr_tr: Daha düşük seviyelerde bir yapı kullanmanız gerekirse, bir şeyleri yanlış yapıyorsunuz demektir.

source: Use title case for headings.
tr_tr: Ana başlıklar için başlığı kullanın.

source: Lists
tr_tr: Listeler

source: Lists should have a new line in between each indent level. The highest indent should have ``0`` indentation, and subsequent sublists should have an indentation starting at the first character of the previous indentation.
tr_tr: Listelerin her girinti düzeyi arasında yeni bir satır olması gerekir. En yüksek girinti ``0`` girintiye sahip olmalı ve sonraki alt listeler, önceki girintinin ilk karakterinden başlayan bir girintiye sahip olmalıdır.

source: Code blocks
tr_tr: Kod Blokları

source: All code blocks should have a language specified.
tr_tr: Tüm kod bloklarının belirtilmiş bir dili olmalıdır.

source: Exception: Content where formatting must be preserved and has no language. Instead use ``text``.
tr_tr: İstisna: Biçimlendirmenin korunması gereken ve dili olmayan içerik. Bunun yerine ``metin`` kullanın.

source: Follow the `WPILib style guide <https://github.com/wpilibsuite/styleguide/>`_ for C++ and Java example code. For example, use two spaces for indentation in C++ and Java.
tr_tr: C ++ ve Java örnek kodu için `WPILib biçim kılavuzunu <https://github.com/wpilibsuite/styleguide/>`_ takip ediniz. Örneğin, C++ ve Java'da girinti için iki boşluk kullanın.

source: Admonitions
tr_tr: Tavsiyeler

source: Admonitions (list `here <https://docutils.sourceforge.io/docs/ref/rst/directives.html#admonitions>`__) should have their text on the same line as the admonition itself. There are exceptions to this rule however, when having multiple sections of content inside of admonition. Generally having multiple sections of content inside of an admonition is not recommended.
tr_tr: Uyarı (`burada listeleyin <https://docutils.sourceforge.io/docs/ref/rst/directives.html#admonitions> '__) metinleri, uyarının kendisiyle aynı satırda olmalıdır. Bununla birlikte, uyarının içinde birden fazla içerik bölümü bulunduğunda, bu kuralın istisnaları vardır. Genellikle bir uyarının içinde birden çok içerik bölümü olması tavsiye edilmez.

source: Use
tr_tr: Kullanın

source: NOT
tr_tr: Yanlış

source: Links
tr_tr: Linkler

source: It is preferred to format links as anonymous hyperlinks. The important thing to note is the **two** underscores appending the text. In the situation that only one underscore is used, issues may arise when compiling the document.
tr_tr: Bağlantıların anonim köprüler olarak biçimlendirilmesi tercih edilir. Unutulmaması gereken önemli nokta, metni eklenecek **iki** alt çizgidir. Yalnızca bir alt çizginin kullanılması durumunda, belge derlenirken sorunlar ortaya çıkabilir.

source: However, in some cases where the same link must be referenced multiple times, the syntax below is accepted.
tr_tr: Bununla birlikte, aynı bağlantıya birden çok kez başvurulması gereken bazı durumlarda, aşağıdaki sözdizimi kabul edilir.

source: Images
tr_tr: Resimler

source: Images should be created with ``1`` new line separating content and directive.
tr_tr: Görseller, içerik ve yönergeyi ayıran ``1`` yeni satırla oluşturulmalıdır.

source: All images (including vectors) should be less than ``500`` kilobytes in size. Please make use of a smaller resolution and more efficient compression algorithms.
tr_tr: Tüm görseller (vektörler dahil) boyut olarak ``500`` kilobayttan daha küçük olmalıdır. Lütfen daha küçük bir çözünürlük ve daha verimli sıkıştırma algoritmaları kullanın.

source: Image Files
tr_tr: Resim dosyaları

source: Image files should be stored in the document directory, sub-directory of ``images``
tr_tr: Görüntü dosyaları belge dizininde, ``images`` alt dizininde saklanmalıdır.

source: They should follow the naming scheme of ``document-title-1.png`` so on and so forth.
tr_tr: ``document-title-1.png`` vb. Adlandırma şemasını takip etmelidirler.

source: They should be of the ``.png`` or ``.jpg`` image extension. ``.gif`` is unacceptable due to lack of Sphinx support.
tr_tr: ``.Png`` veya ``.jpg`` resim uzantısında olmalıdırlar. ``.gif``, Sphinx'in desteği olmaması nedeniyle kabul edilemez.

source: Vector Images
tr_tr: Vectorel Resimler

source: SVG files are supported through the ``svg2pdfconverter`` Sphinx extension.
tr_tr: SVG dosyaları ``svg2pdfconverter`` Sphinx uzantısı ile desteklenir.

source: Simply use them as you would with any other image.
tr_tr: Bunları başka herhangi bir resim dosyasında yaptığınız gibi kullanın.

source: Ensure that any embedded images in the vector do not bloat the vector to exceed the 500KB limit.
tr_tr: Vektördeki gömülü görüntülerin vektörü 500KB sınırını aşacak şekilde şişirmediğinden emin olun.

source: Draw.io Diagrams
tr_tr: Draw.io Diyagramları

source: Draw.io (also known as `diagrams.net <https://app.diagrams.net/>`__) diagrams are supported through ``svg`` files with embedded ``.drawio`` metadata, allowing the ``svg`` file to act as a source file of the diagrams, and to be rendered like a normal vector graphics file.
tr_tr: Draw.io (aynı zamanda `diagrams.net <https://app.diagrams.net/>`__ olarak da bilinir) diyagramları, gömülü ``.drawio`` meta verisine sahip` ``svg`` dosyalarıyla desteklenir ve ``svg`` dosyası, diyagramların kaynak dosyası olarak işlev görür, normal bir vektör grafik dosyası gibi işlenir.

source: Simply use them like you would any other vector image, or any other image.
tr_tr: Bunları başka herhangi bir vektör görüntüsü veya başka bir görüntü gibi kullanın.

source: Draw.io Files
tr_tr: Draw.io Dosyaları

source: Draw.io files follow almost the same naming scheme as normal images. To keep track of files that have the embedded ``.drawio`` metadata, append a ``.drawio`` to the end of the file name, before the extension, meaning the name of the file should be ``document-title-1.drawio.svg`` and so on. Additionally, diagrams should be stored in the document directory in a sub-folder named ``diagrams``.
tr_tr: Draw.io dosyaları, normal resimler ile neredeyse aynı adlandırma düzenini izler. Gömülü ``.drawio`` meta verisine sahip dosyaları takip etmek için, dosya adının sonuna, uzantının önüne bir ``.drawio`` ekleyin, yani dosyanın adı ``document-title-1.drawio.svg`` vb olmalıdır. Ek olarak, diyagramlar belge dizininde ``diagrams`` adlı bir alt klasörde saklanmalıdır.

source: For the specifics of saving a diagram as a ``.svg`` with metadata, take a look at :ref:`docs/contributing/frc-docs/drawio-saving-instructions:Draw.io Saving Instructions`.
tr_tr: Bir diyagramı meta verilerle ``.svg`` olarak kaydetmenin ayrıntıları için, buraya bakınız :ref:`docs/contributing/frc-docs/drawio-saving-instructions:Draw.io Saving Instructions`.

source: Make sure you don't modify any file that is in a ``diagrams`` folder, or ends in ``.drawio.svg`` in any program other than draw.io, otherwise you might risk breaking the metadata of the file, making it uneditable.
tr_tr: Draw.io dışında herhangi bir programda ``diagrams`` klasöründe bulunan veya ``.drawio.svg`` ile biten herhangi bir dosyayı değiştirmediğinizden emin olun, aksi takdirde dosyanın meta verilerini kırma riskiniz olabilir. , bu dosyayı düzenlenemez hale getirebilir.

source: Table of Contents (TOC)
tr_tr: İçindekiler (TOC-Table of Contents)

source: Each category should contain an ``index.rst``. This index file should contain a ``maxdepth`` of ``1``. Sub-categories are acceptable, with a ``maxdepth`` of 1.
tr_tr: Her kategori bir ``index.rst`` içermelidir. Bu dizin dosyası, ``maxdepth`` maksimum derinliği ``1`` içermelidir. Alt kategoriler ``maxdepth`` 1 ile kabul edilebilir.

source: The category ``index.rst`` file can then be added added to the root index file located at ``source/index.rst``.
tr_tr: ``index.rst`` kategori dosyası, daha sonra ``source/index.rst`` konumunda bulunan kök dizin dosyasına eklenebilir.

source: Examples
tr_tr: Örnekler

source: Important Note!
tr_tr: Önemli Not!

source: This list is not exhaustive and administrators reserve the right to make changes. Changes will be reflected in this document.
tr_tr: Bu liste kapsamlı değildir ve yöneticiler değişiklik yapma hakkını saklı tutar. Değişiklikler bu belgeye yansıtılacaktır.
