Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/frc-docs/translations.po
Languages: he_il

source: Translations
he_il: תרגומים

source: frc-docs supports translations using the web-based `Transifex <https://www.transifex.com>`__ utility. frc-docs is currently testing Spanish Mexico (es_MX) and French Canada (fr_CA) translation support. We hope to support Chinese (zh_CN), Hebrew Israel (he_IL), and Turkish (tr_TR) in the future. Translators that are fluent in *both* English and one of the specified languages would be greatly appreciated to contribute to the translations.
he_il: frc-docs תומך בתרגומים באמצעות כלי מבוסס דפדפן, `Transifex <https://www.transifex.com>`__. frc-docs בוחן כעת את תמיכת התרגום בספרדית מקסיקו (es_MX) וצרפתית קנדית (fr_CA). אנו מקווים לתמוך בעתיד בסינית (zh_CN), עברית (he_IL) ובטורקית (tr_TR). מתרגמים השולטים הן באנגלית והן אחת השפות שצוינו יוערכו מאוד לתרום לתרגומים.

source: Workflow
he_il: זרימת עבודה

source: Here are some steps to follow for translating frc-docs.
he_il: להלן מספר צעדים עבור תרגום frc-docs.

source: Sign up for `Transifex <https://www.transifex.com/>`__ and ask to join the `frc-docs project <https://www.transifex.com/wpilib/frc-docs>`__, and request access to the language you'd like to contribute to.
he_il: הירשמו ל-`Transifex <https://www.transifex.com/>`__, הצטרפו לפרויקט `frc-docs <https://www.transifex.com/wpilib/frc-docs>`__ ובקשו גישה לשפה שאליה תרצה לתרום.

source: Join the wpilibsuite `gitter <https://gitter.im/wpilibsuite/wpilib>`__! This is a direct means of communication with the WPILib team. You can use this to ask us questions in a fast and streamlined fashion.
he_il: הצטרפו `ל-Gitter של wpilibsuite <https://gitter.im/wpilibsuite/wpilib>`__! זהו אמצעי תקשורת ישיר עם צוות WPILib. ניתן להשתמש בזה כדי לשאול אותנו שאלות בצורה מהירה ויעילה.

source: You may be contacted and asked questions involving contributing languages before being granted access to the frc-docs translation project.
he_il: ייתכן וניצור עמכם קשר ונשאל שאלות הקשורת לשפת התרגום לפני שתקבלו גישה לפרויקט התרגום של frc-docs.

source: Translate your language!
he_il: תרגמו את השפה שלכם!

source: Links
he_il: קישורים

source: Links must be preserved in their original syntax. To translate a link, you can replace the TRANSLATE ME text (this will be replaced with the english title) with the appropriate translation.
he_il: יש לשמור על קישורים בתחביר המקורי שלהם. לתרגום קישור ניתן להחליף את הטקסט TRANSLATE ME (זה יוחלף בכותרת באנגלית) בתרגום המתאים.

source: An example of the original text may be
he_il: דוגמה לטקסט המקורי עשויה להיות:

source: where the ``Wiring the FRC Control System Document`` then gets translated.
he_il: כאשר ``Wiring the FRC Control System Document`` יתורגם.

source: Another example is below
he_il: דוגמא נוספת:

source: Publishing Translations
he_il: פרסום התרגומים

source: Translations are pulled from Transifex and published automatically each day.
he_il: תרגומים נמשכים מ-Transifex ומתפרסמים אוטומטית כל יום.

source: Accuracy
he_il: דיוק

source: Translations should be accurate to the original text. If improvements to the English text can be made, open a PR or issue on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository. These can then get translated on merge.
he_il: התרגומים צריכים להיות מדויקים לטקסט המקורי. אם ניתן לבצע שיפורים בטקסט באנגלית, פתחו PR או Issue ב-Repository של `frc-docs <https://github.com/wpilibsuite/frc-docs>`__. לאחר מכן ניתן לתרגם אותם לאחר המיזוג.
