Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware/sensors/ultrasonics-hardware.po
Languages: es_mx

source: Ultrasonics - Hardware
es_mx: Ultrasónicos - Hardware

source: This section covers ultrasonic sensor hardware. For a software guide to ultrasonics, see :ref:`docs/software/sensors/ultrasonics-software:Ultrasonics - Software`.
es_mx: Esta sección cubre el hardware del sensor ultrasónico. Para la guia del software de los ultrasonidos, ver :ref:`docs/software/sensors/ultrasonics-software:Ultrasonics - Software` .

source: Types of ultrasonics
es_mx: Tipos de ultrasónicos.

source: While all ultrasonic rangefinders operate on the "ping-response" principle outlined above, they may vary in the way they communicate with the roboRIO.
es_mx: Mientras todos los telemetros ultrasónicos operan en “respuesta ping”, principio utilizado anteriormente, puede variar la forma en que se comunica con la roboRIO.

source: Analog ultrasonics
es_mx: Ultrasónicos análogos

source: Analog ultrasonics output a simple analog voltage corresponding to the distance to the target, and thus connect to an :doc:`analog input <analog-inputs-hardware>` port. The user will need to calibrate the voltage-to-distance conversion in :ref:`software <docs/software/sensors/ultrasonics-software:Ultrasonics - Software>`.
es_mx: Estos ultrasónicos sacan un voltaje análogo simple que corresponde a la distancia del objetivo para así ser conectado a un puerto de entrada análoga<analog-inputs-hardware>. El usuario necesita calibrar la conversión de voltaje a distancia en :ref:`software <docs/software/sensors/ultrasonics-software:Ultrasonics - Software>`.

source: Ping-response ultrasonics
es_mx: Ultrasónicos de respuesta ping

source: While, as mentioned, all ultrasonics are functionally ping-response devices, a "ping response" ultrasonic is one configured to connect to :ref:`both a digital input and a digital output <docs/hardware/sensors/digital-inputs-hardware:Connecting a sensor that uses multiple DIO ports>`. The digital output is used to send the ping, while the input is used to read the response.
es_mx: Mientras todos los ultrasónicos son dispositivos de respuesta ping funcionales, un ultrasónico de “respuesta ping“ está configurado para ser conectado en a una entrada y salida digital. Ver en <docs/hardware/sensors/digital-inputs-hardware:Connecting a sensor that uses multiple DIO ports>`. La salida digital es usada para mandar el ping mientras que la entrada para mandar la respuesta.

source: Serial ultrasonics
es_mx: Ultrasónicos de serie

source: Some more-complicated ultrasonic sensors may communicate with the RIO over one of the :doc:`serial buses <serial-buses>`, such as RS-232.
es_mx: Algunos sensores ultrasónicos más complicados pueden comunicarse con la RÍO sobre unos de los :doc:`serial buses <serial-buses>` , tales como RS-232.

source: Caveats
es_mx: Advertencias

source: Ultrasonic sensors are generally quite easy to use, however there are a few caveats. As ultrasonics work by measuring the time between the pulse and its echo, they generally measure distance only to the *closest* target in their range. Thus, it is extremely important to pick the right sensor for the job. The documentation for ultrasonic sensors will generally include a picture of the "beam pattern" that shows the shape of the "window" in which the ultrasonic will detect a target - pay close attention to this when selecting your sensor.
es_mx: Los sensores ultrasónicos son generalmente bastante fáciles de usar, sin embargo, hay algunas advertencias. Como los ultrasonidos funcionan midiendo el tiempo entre el pulso y su eco, generalmente miden la distancia solo al objetivo *más cercano* en su rango. Por lo tanto, es extremadamente importante elegir el sensor adecuado para el trabajo. La documentación de los sensores ultrasónicos generalmente incluirá una imagen del "patrón de haz" que muestra la forma de la "ventana" en la que el ultrasonido detectará un objetivo; preste mucha atención a esto cuando seleccione su sensor.

source: Ultrasonic sensors are also susceptible to interference from other ultrasonic sensors. In order to minimize this, the roboRIO can run ping-response ultrasonics in a "round-robin" fashion - however, in competition, there is no sure way to ensure that interference from sensors mounted on other robots does not occur.
es_mx: Igualmente estos sensores son susceptibles a tener interferencia con otros sensores iguales. Para disminuir esto, la roboRIO puede correr un ultrasonido de respuesta ping en un "round-robin" - sin embargo en las competencias no existe un modo seguro de anular esta interferencia en los sensores montados en otros robots.

source: Finally, ultrasonics may not be able to detect objects that absorb sound waves, or that redirect them in strange ways. Thus, they work best for detecting hard, flat objects.
es_mx: Finalmente, estos sensores probablemente no lleguen a detectar objetos que absorben las ondas de sonido o que las lleguen a redireccionar a extrañas vías. Así los sensores trabajan mejor detectando arduamente objetos planos.
