Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/networktables/client-side-program.po
Languages: tr_tr

source: Creating a client-side program
tr_tr: İstemci tarafı bir program oluşturmak

source: If all you need to do is have your robot program communicate with GRIP or a dashboard running on the Driver Station laptop, then the previous examples of writing robot programs are sufficient. But if you would like to write some custom client code that would run on the drivers station or on a coprocessor then you need to know how to build Network Tables programs for those (non-roboRIO) platforms.
tr_tr: Yapmanız gereken tek şey, robot programınızın GRIP veya Driver Station dizüstü bilgisayarda çalışan bir gösterge panosu ile iletişim kurması ise, o zaman önceki robot programları yazma örnekleri yeterlidir. Ancak, sürücü istasyonunda veya bir yardımcı işlemcide çalışacak bazı özel istemci kodları yazmak isterseniz, bu (roboRIO olmayan) platformlar için Network Table programlarını nasıl oluşturacağınızı bilmeniz gerekir.

source: A basic client program looks like the following example.
tr_tr: Temel bir istemci programı aşağıdaki örneğe benzer.

source: In this example an instance of NetworkTables is created and a NetworkTableEntry if created to reference the values of "x" and "y" from a table called "datatable".
tr_tr: Bu örnekte bir NetworkTables örneği yaratılır ve "datatable" adlı bir tablodan "x" ve "y" değerlerine başvurmak için oluşturulmuşsa bir NetworkTableEntry.

source: Then this instance is started as a NetworkTable client with the team number (the roboRIO is always the server). Additionally, if the program is running on the Driver Station computer, by using the startDSClient() method, NetworkTables will get the robot IP address from the Driver Station.
tr_tr: Daha sonra bu örnek, takım numarasıyla (roboRIO her zaman sunucudur) bir NetworkTable istemcisi olarak başlatılır. Ek olarak, program Driver Station bilgisayarında çalışıyorsa startDSClient() yöntemini kullanarak, NetworkTables robot IP adresini Driver Station'dan alacaktır.

source: Then this sample program simply loops once a second and gets the values for x and y and prints them on the console. In a more realistic program, the client might be processing or generating values for the robot to consume.
tr_tr: Daha sonra bu örnek program, saniyede bir döngü yapar ve x ve y değerlerini alır ve bunları konsolda yazdırır. Daha gerçekçi bir programda, istemci robotun tüketmesi için değerleri işliyor veya üretiyor olabilir.

source: Building the program
tr_tr: Programı oluşturmak

source: When building and running the program you will need some additional libraries to include with your client-side program. These are:
tr_tr: Programı oluştururken ve çalıştırırken, istemci tarafı programınıza dahil etmek için bazı ek kitaplıklara ihtiyacınız olacaktır. Bunlar:

source: https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/ntcore/ntcore-jni/ (ntcore native libs for all desktop platforms)
tr_tr: https://frcmaven.wpi.edu/artifactory/release/edu/wpi/first/ntcore/ntcore-jni/ (tüm masaüstü platformları için ntcore yerel kitaplıklar)

source: The desktop platform jar is for Windows, macOS, and Linux.
tr_tr: Desktop platform jar Windows, macOS ve Linux içindir.

source: Building using Gradle
tr_tr: Gradle kullanarak inşa etme

source: The dependencies above can be added to the ``dependencies`` block in a ``build.gradle`` file. The ``ntcore-java`` and ``wpiutil-java`` libraries are required at compile-time and the JNI dependencies are required at runtime. The JNI dependencies for all supported platforms should be added to the ``build.gradle`` if cross-platform support for the application is desired.
tr_tr: Yukarıdaki dependencies, bir ``build.gradle`` dosyasındaki ``dependencies`` bloğuna eklenebilir. Derleme sırasında ``ntcore-java`` ve ``wpiutil-java`` kitaplıkları gereklidir ve çalışma zamanında JNI dependencies gereklidir. Uygulama için platformlar arası destek isteniyorsa, desteklenen tüm platformlar için JNI bağımlılıkları ``build.gradle`` öğesine eklenmelidir.

source: First, the FRC\ |reg| Maven repository should be added to the ``repositories`` block. Note that this is not required if you are using the GradleRIO plugin with your application.
tr_tr: İlk olarak, FRC \ |reg| Maven deposu, ``repositories-depolar`` bloğuna eklenmelidir. Uygulamanızda GradleRIO eklentisini kullanıyorsanız bunun gerekli olmadığını unutmayın.

source: Then, the dependencies can be added to the ``dependencies`` block. Here, ``VERSION`` should be replaced with the latest version number of the following dependencies. This usually corresponds to the version number of the latest WPILib release.
tr_tr: Daha sonra bağımlılıklar ``dependencies`` bloğuna eklenebilir. Burada, ``VERSION`` aşağıdaki bağımlılıkların en son sürüm numarası ile değiştirilmelidir. Bu genellikle en son WPILib sürümünün sürüm numarasına karşılık gelir.
