Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/networktables/reading-array-values-published-by-networktables.po
Languages: es_mx, tr_tr

source: Reading array values published by NetworkTables
es_mx: Lectura de valores de matriz escritos por Tablas de Enrutamiento
tr_tr: NetworkTables tarafından yayınlanan dizi değerlerini okuma

source: This article describes how to read values published by NetworkTables using a program running on the robot. This is useful when using computer vision where the images are processed on your driver station laptop and the results stored into NetworkTables possibly using a separate vision processor like a raspberry pi, or a tool on the robot like GRIP, or a python program to do the image processing.
es_mx: Este artículo describe como leer valores escritos por una Tabla de Enrutamiento usando un programa en ejecución en el robot. Esto es útil cuando se usa visión por computadora donde las imágenes son procesadas en la DriverStation de su laptop y los resultados son guardados en la Tabla de Enrutamiento posiblemente usando un procesador de visión por separado como un Raspberry Pi o una herramienta en el robot como el GRIP, o un programa de Python para el procesamiento de imágenes.
tr_tr: Bu makale, robot üzerinde çalışan bir program kullanılarak NetworkTables tarafından yayınlanan değerlerin nasıl okunacağını açıklar. Bu, görüntülerin sürücü istasyonu dizüstü bilgisayarınızda işlendiği ve sonuçların muhtemelen bir raspberry pi gibi ayrı bir görüntü işlemcisi veya robot üzerinde GRIP gibi bir araç veya görüntü işleyen python programı için faydalıdır.

source: Very often the values are for one or more areas of interest such as goals or game pieces and multiple instances are returned. In the example below, several x, y, width, height, and areas are returned by the image processor and the robot program can sort out which of the returned values are interesting through further processing.
es_mx: Comúnmente los valores son para una o más áreas de interés tales como objetivos o piezas de juego y son regresadas múltiples instancias. En el ejemplo a continuación, varios valores x, y, ancho, altura, y áreas son entregados por el procesamiento de imagen y el programa del robot puede decidir cuál de los valores entregados son de interés para los siguientes procesamientos.
tr_tr: Çoğunlukla değerler, hedefler veya oyun parçaları gibi bir veya daha fazla ilgi alanı içindir ve birden çok örnek döndürülür. Aşağıdaki örnekte, görüntü işlemcisi tarafından birkaç x, y, genişlik, yükseklik ve alan döndürülür ve robot programı, daha sonraki işlemlerle döndürülen değerlerden hangisinin ilgi çekici olduğunu belirleyebilir.

source: Verify the network table keys being published
es_mx: Verificar que las claves de red sean publicadas
tr_tr: Yayınlanmakta olan ağ tablosu anahtarlarını doğrulayın

source: You can verify the names of the network table keys used for publishing the values by using the Outline Viewer application. It is a Java program in your user directory in the wpilib/<YEAR>/tools folder. The application is started by selecting the "WPILib" menu in Visual Studio Code then Start Tool then "OutlineViewer". In this example, with the image processing program running (GRIP) you can see the values being put into NetworkTables.
es_mx: Usted puede verificar los nombres de las claves de la tabla de enrutamiento que se utilizan para publicar los valores mediante la aplicación de Outline Viewer. Es un programa Java en su directorio de usuario en la carpeta wpilib/<YEAR>/tools. La aplicación se inicia seleccionando el menú "WPILib" en Visual Studio Code, luego Start Tool y después "OutlineViewer". En este ejemplo, con el programa de procesamiento de imágenes en ejecución (GRIP), usted puede ver los valores que se colocan en la Tabla de Enrutamiento.

source: In this case the values are stored in a table called GRIP and a sub-table called myContoursReport. You can see that the values are in brackets and there are 2 values in this case for each key. The network table key names are centerX, centerY, area, height and width.
es_mx: En este caso los valores son guardados en una tabla llamada GRIP y una subtabla llamada myContoursReport. Puede ver que los valores están en corchetes y se tienen 2 valores en cada índice en este caso. Los nombres de los índices de la tabla de enrutamiento son centerX, centerY, area, height and width.
tr_tr: Bu durumda değerler GRIP adlı bir tabloda ve myContoursReport adlı bir alt tabloda saklanır. Değerlerin parantez içinde olduğunu ve bu durumda her anahtar için 2 değer olduğunu görebilirsiniz. Ağ tablosu anahtar adları centerX, centerY, area, height ve width'dir.

source: Both of the following examples are extremely simplified programs that just illustrate the use of NetworkTables. All the code is in the robotInit() method so it's only run when the program starts up. In your programs, you would more likely get the values in code that is evaluating which direction to aim the robot in a command or a control loop during the autonomous or teleop periods.
es_mx: Los dos ejemplos siguientes son programas extremadamente simplificados que solamente ilustran el uso de las Tablas de Enrutamiento. Todo el código se encuentra en el método robotInit() que solo se ejecuta cuando el programa inicia. En sus programas, usted buscará obtener los valores del código que evalúen en que dirección apuntar el robot en un comando o un bucle de control durante los periodos de autónomo o teleoperado.
tr_tr: Aşağıdaki örneklerin her ikisi de, sadece NetworkTables'ın kullanımını gösteren, son derece basitleştirilmiş programlardır. Tüm kod robotInit() yöntemindedir, bu nedenle yalnızca program başladığında çalıştırılır. Programlarınızda, otonom veya teleop dönemlerinde robotu bir komutta veya bir kontrol döngüsünde hangi yöne hedefleyeceğinizi değerlendiren koddaki değerleri büyük olasılıkla alırsınız.

source: Writing a program to access the keys
es_mx: Escritura de un programa para acceder a los índices
tr_tr: Anahtarlara erişmek için bir program yazma

source: The steps to getting the values and, in this program, printing them are:
es_mx: Los pasos para obtener los valores y, en este programa, escribirlos son:
tr_tr: Değerleri alma ve bu programda yazdırmanın adımları şunlardır:

source: Declare the table variable that will hold the instance of the subtable that have the values.
es_mx: Declarar la tabla variable que guardará la instancia de la subtabla que tendrá los valores.
tr_tr: Değerlere sahip alt tablo örneğini tutacak tablo değişkenini bildirin.

source: Initialize the subtable instance so that it can be used later for retrieving the values.
es_mx: Inicializar la instancia de la subtabla para que pueda ser usada después para recuperar los valores.
tr_tr: Daha sonra değerleri almak için kullanılabilmesi için alt tablo örneğini başlatın.

source: Read the array of values from NetworkTables. In the case of a communicating programs, it's possible that the program producing the output being read here might not yet be available when the robot program starts up. To avoid issues of the data not being ready, a default array of values is supplied. This default value will be returned if the network table key hasn't yet been published. This code will loop over the value of areas every 20ms.
es_mx: Leer de la Tabla de Enrutamiento la matriz de valores. En el caso de la comunicación de programas, es posible que el programa que produce la salida leída no esté disponible cuando el programa del robot inicia. Para evitar problemas de que los datos no estén listos, una matriz predeterminada de datos es proporcionada. Este valor predeterminado será regresado si el índice de la tabla de enrutamiento no ha sido escrito. Este código se repetirá sobre el valor de areas cada 20ms.
tr_tr: NetworkTables'dan değer dizisini okuyun. İletişim programları söz konusu olduğunda, burada okunan çıktıyı üreten program, robot programı başladığında henüz mevcut olmayabilir. Verilerin hazır olmaması sorunlarından kaçınmak için varsayılan bir değerler dizisi sağlanır. Ağ tablosu anahtarı henüz yayınlanmadıysa bu varsayılan değer döndürülecektir. Bu kod, her 20 ms'de bir alanların değeri üzerinde döngü oluşturacaktır.

source: Program output
es_mx: Salidas del Programa
tr_tr: Program çıktısı

source: In this case the program is only looking at the array of areas, but in a real example all the values would more likely be used. Using the Riolog in VS Code or the Driver Station log you can see the values as they are retrieved. This program is using a sample static image so they areas don't change, but you can imagine with a camera on your robot, the values would be changing constantly.
es_mx: En este caso el programa solamente está buscando en la matriz de las areas, pero en un ejemplo real sería más probable usar todos los valores. Usando el Riolog en VS Code o la Driver Station Log puede ver los valores así como son enviados. Este programa está usando de muestra una imagen estática así que las areas no cambian, pero puede imaginar que con la cámara en el robot, los valores estarían constantemente cambiando.
