Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/introduction/what-*-vision.po
Languages: tr_tr

source: What is Vision?
tr_tr: Vision nedir?

source: Vision in FRC uses a camera connected to the robot in order to help teams score and drive, during both the autonomous and teleoperated periods.
tr_tr: FRC'de Vision, ekiplerin hem otonom hem de teleoperasyon periyotları boyunca skor yapmasına ve sürüş yapmasına yardımcı olmak için robota bağlı bir kamera kullanır.

source: Vision Methods
tr_tr: Görme Yöntemleri

source: There are two main method that most teams use for vision in FRC.
tr_tr: FRC'de çoğu ekibin görmek için kullandığı iki ana yöntem vardır.

source: Streaming
tr_tr: Yayın Akışı

source: This method involves streaming the camera to the Driver Station so that the driver and manipulator can get visual information from the robot's point of view. This method is simple and takes little time to implement, making it a good option if you do not need features of vision processing.
tr_tr: Bu yöntem, sürücünün ve manipülatörün robotun bakış açısından görsel bilgileri alabilmesi için kameranın Sürücü İstasyonuna aktarılmasını içerir. Bu yöntem basittir ve uygulanması çok az zaman alır, bu da görme işleme özelliklerine ihtiyacınız yoksa iyi bir seçenektir.

source: :ref:`Streaming using the roboRIO <docs/software/vision-processing/roborio/using-the-cameraserver-on-the-roborio:Using the CameraServer on the roboRIO>`
tr_tr: :ref: `roboRIO <docs/software/vision-processing/roborio/using-the-cameraserver-on-the-roborio:Using the CameraServer on the roboRIO> kullanarak yayın yapma`

source: :ref:`Streaming using an Axis Camera <docs/software/vision-processing/axis-camera/index:Vision with an Axis Camera>`
tr_tr: : ref:`Bir Eksen Kamerası kullanarak akış <docs/software/vision-processing/axis-camera/index:Vision with an Axis Camera>`

source: Processing
tr_tr: İşleme

source: Instead of only streaming the camera to the Driver Station, this method involves using the frames captured by the camera to compute information, such as a game piece's or target's angle and distance from the camera. This method requires more technical knowledge and time in order to implement, as well as being more computationally expensive. However, this method can help improve autonomous performance and assist in "auto-scoring" operations during the teleoperated period. This method can be done using the roboRIO or a coprocessor such as the Raspberry Pi using either OpenCV or programs such as GRIP.
tr_tr: Kamerayı yalnızca Driver Station'a aktarmak yerine, bu yöntem bir oyun parçası veya hedefin kamera ile olan açısı ve mesafesi gibi bilgileri hesaplamak için kamera tarafından yakalanan karelerin kullanılmasını içerir. Bu yöntem, hesaplama açısından daha pahalı olmasının yanı sıra, uygulanması için daha fazla teknik bilgi ve zaman gerektirir. Bununla birlikte, bu yöntem, otonom performansın iyileştirilmesine yardımcı olabilir ve uzaktan çalıştırılan süre boyunca "otomatik puanlama" işlemlerine yardımcı olabilir. Bu yöntem roboRIO veya Raspberry Pi gibi bir yardımcı işlemci kullanılarak OpenCV veya GRIP gibi programlar kullanılarak yapılabilir.

source: :ref:`Vision Processing with Raspberry Pi <docs/software/vision-processing/frcvision/index:Vision with FRCVision>`
tr_tr: :ref:` Raspberry Pi <docs/software/vision-processing/frcvision/index:Vision with FRCVision> ile Görüntü İşleme`

source: :ref:`Vision Processing with GRIP <docs/software/vision-processing/grip/index:Vision with GRIP>`
tr_tr: :ref:`GRIP <docs/software/vision-processing/grip/index:Vision with GRIP> ile Görsel İşleme`

source: :ref:`Vision Processing with the roboRIO <docs/software/vision-processing/roborio/using-the-cameraserver-on-the-roborio:Advanced Camera Server Program>`
tr_tr: :ref:` roboRIO <docs/software/vision-processing/roborio/using-the-cameraserver-on-the-roborio:Advanced Camera Server Program> ile Görüntü İşleme`

source: For additional information on the pros and cons of using a coprocessor for vision processing, see the next page, :ref:`docs/software/vision-processing/introduction/strategies-for-vision-programming:Strategies for Vision Programming`.
tr_tr: Görsel işleme için bir yardımcı işlemci kullanmanın artıları ve eksileri hakkında ek bilgi için sonraki sayfaya bakın :ref:`docs / software / vision-processing / Introduction / Strategies-for-vision-programlama: Strategies for Vision Programming`.
