Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/tasks/beta-task-overview.po
Languages: tr_tr

source: Beta Task Overview
tr_tr: Beta Task Genel Bakış

source: This document provides an overview of the Tasks assigned for the Control System Beta Test. Further details on each Task can be found in the subsequent pages of this section.
tr_tr: Bu belge, Kontrol Sistemi Beta Testi için atanan Görevlere genel bir bakış sağlar. Her bir Görevle ilgili daha fazla ayrıntı, bu bölümün sonraki sayfalarında bulunabilir.

source: Task 0 - Background and Preparation
tr_tr: Görev 0 - Arka Plan ve Hazırlık

source: The purpose of Task 0 is to complete some housekeeping tasks and familiarize yourself with the tools and documentation for the Beta Test before beginning. This task consists of 1 Objective:
tr_tr: Görev 0'ın amacı, başlamadan önce bazı temizlik görevlerini tamamlamak ve Beta Testi için gerekli araçlara ve belgelere kendinizi alıştırmaktır. Bu görev 1 Hedeften oluşur:

source: Beta Test Tools and Documentation Familiarization
tr_tr: Beta Test Araçları ve Dokümantasyon Tanımlama

source: Task 1 - Install Software (Targeted Completion 11/8/2020)
tr_tr: Görev 1 - Yazılımı Yükleyin (Hedeflenen Tamamlanma 11/8/2020)

source: The purpose of Task 1 is to complete installation of the new Control System software. This task consists of 1 Objective
tr_tr: Görev 1'in amacı, yeni Kontrol Sistemi yazılımının kurulumunu tamamlamaktır. Bu görev 1 Hedeften oluşur

source: Install the necessary software for your assigned Beta Test language (LabVIEW or VSCode + plugins, NI FRC Game Tools, CTRE installer if using CANTalon SRX)
tr_tr: Atanmış Beta Test diliniz için gerekli yazılımı kurun (LabVIEW veya VSCode + eklentileri, NI FRC Game Tools, CANTalon SRX kullanıyorsanız CTRE yükleyici)

source: Task 2 - Basic Benchtop Test (Targeted Completion 11/15/2020)
tr_tr: Görev 2 - Temel Masaüstü Testi (Hedeflenen Tamamlama 11/15/2020)

source: The purpose of Task 2 is to get the base new Control System software set up and running. This helps minimize complexity to ease debugging of any issues that do occur. In this task you will set up the development environment for your programming language, configure the roboRIO, load and debug a simple program. This Task consists of 2 Objectives:
tr_tr: Görev 2'nin amacı, temel yeni Kontrol Sistemi yazılımını kurmak ve çalıştırmaktır. Bu, oluşan herhangi bir sorunun hata ayıklamasını kolaylaştırmak için karmaşıklığı en aza indirmeye yardımcı olur. Bu görevde, programlama diliniz için geliştirme ortamını kuracak, roboRIO'yu yapılandıracak, basit bir program yükleyecek ve hata ayıklayacaksınız. Bu Görev 2 Hedeften oluşur:

source: Configure the roboRIO
tr_tr: RoboRIO’yu yapılandırın

source: Create, Build and Load Default Program
tr_tr: Oluşturun, Varsayılan Programı Oluşturun ve Yükleyin

source: Task 3 - Port Previous Robot Code (Targeted Completion 11/22/2020)
tr_tr: Görev 3 - Önceki Robot Kodu Bağlantı Noktası (Hedeflenen Tamamlama 11/22/2020)

source: The purpose of Task 3 is to port the previous year's robot code with the new Control System software and bring it to full functionality. This Task consists of 2 Objectives and 1 Optional Objective:
tr_tr: Görev 3'ün amacı, önceki yılın robot kodunu yeni Kontrol Sistemi yazılımına taşımak ve tam işlevselliğe getirmektir. Bu görev şunlardan oluşur: 2 Hedef ve 1 İsteğe Bağlı Hedef

source: Port Existing Robot Code to new System
tr_tr: Mevcut Robot Kodunu Yeni Sisteme Taşıyın

source: Wireless Operation of FRC Robot
tr_tr: FRC Robotunun Kablosuz Çalışması

source: Task 4 - New Code and Advanced Feature Testing (Targeted Completion 11/29/2020)
tr_tr: Görev 4 - Yeni Kod ve Gelişmiş Özellik Testi (Hedeflenen Tamamlama 11/29/2020)

source: Note: Objectives in Task 4 may be completed in any order.
tr_tr: Not: Görev 4'teki hedefler herhangi bir sırayla tamamlanabilir.

source: The purpose of Task 4 is to write new code in order to test features and functionality of the new Control System software. While we have written up a number of ideas, please feel free to come up with your own and report on what you tried/are trying and how it went.
tr_tr: Görev 4'ün amacı, yeni Kontrol Sistemi yazılımının özelliklerini ve işlevselliğini test etmek için yeni kod yazmaktır. Bir dizi fikir yazmış olsak da, lütfen kendi fikirlerinizi üretmekten ve denediğiniz / denediğinizi ve nasıl gittiğini rapor etmekten çekinmeyin.

source: New Command Based framework
tr_tr: Yeni Komut Tabanlı çerçeve

source: Kinematics classes
tr_tr: Kinematik sınıfları

source: C++/Java Simulator UI
tr_tr: C ++ / Java Simülatörü Kullanıcı Arayüzü
