Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/tasks/task-3-port-code.po
Languages: es_mx

source: Task 3: Port Existing Robot Code to New System
es_mx: Tarea 3: Transferir el Código de Robot Existente a un Nuevo Sistema

source: Task: Port previous season's robot code to new system.
es_mx: Tarea: Transfiera el código del robot de la temporada anterior al nuevo sistema.

source: Overview
es_mx: Vista General

source: The purpose of this task is to port your robot code to the new development environment and bring it to a fully functional state. Make sure to post in the discussions or file a bug in the tracker for any items that do not seem to be working properly.
es_mx: El propósito de esta tarea es transferir su código de robot a el nuevo entorno de desarrollo y llevarlo a un estado completamente funcional. Asegúrese de publicar en las discusiones o de presentar un error en el rastreador para cualquier elemento que no parezca funcionar correctamente.

source: Desired Feedback
es_mx: Retroalimentación Deseada

source: Please keep the following questions in mind as you complete the task and include this information, as appropriate, in your Task 4 report.
es_mx: Por favor tenga en mente las siguientes preguntas en mente mientras completa la tarea e incluya esta información, como es apropiada, en su reporte de Tarea 4.

source: Note any required changes to your robot program not detailed in the documentation for porting robot code.
es_mx: Anote los cambios requeridos en su programa de robot que no estén detallados en la documentación para transferir el código de robot.

source: What problems or difficulties did you encounter?
es_mx: ¿Qué problemas o dificultades encontró?

source: What questions did you have during the process?
es_mx: ¿Qué preguntas tuvo durante el proceso?

source: Any specific suggestions on improving the documentation? (Were any instructions unclear?)
es_mx: ¿Alguna sugerencia específica para mejorar la documentación? (¿Hubo alguna instrucción que no estuviera clara?)

source: Is there anything else you want to tell us related to this task?
es_mx: ¿Hay algo más que nos quiera decir relacionado a la tarea?
