Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/tasks/task-2-configure-and-benchtop.po
Languages: tr_tr

source: Task 2: Configure roboRIO & Benchtop Test
tr_tr: Görev 2: roboRIO ve Masaüstü Testini Yapılandırma

source: Task:
tr_tr: Görev:

source: Image and configure your roboRIO controller.
tr_tr: RoboRIO denetleyicinizin görüntüsünü alın ve yapılandırın.

source: Create, build, load and run a basic robot program (template of your choosing) on the roboRIO benchtop setup.
tr_tr: RoboRIO tezgah üstü kurulumunda temel bir robot programı (sizin seçtiğiniz şablon) oluşturun, oluşturun, yükleyin ve çalıştırın.

source: Overview
tr_tr: Genel Bakış

source: Before using the roboRIO controller with the Beta software, it must be imaged with the new image and configured with your FRC team number. As part of the purpose of this Beta test is to test the documentation and its ease of use, no direct links to setup instructions will be provided. Instructions for configuring the roboRIO are available on the :ref:`docs/zero-to-robot/step-3/index:Step 3: Preparing Your Robot` page.
tr_tr: RoboRIO denetleyicisini Beta yazılımıyla kullanmadan önce, yeni görüntüyle görüntülenmeli ve FRC ekip numaranızla yapılandırılmalıdır. Bu Beta testinin amacının bir parçası olarak dokümantasyonu ve kullanım kolaylığını test etmek olduğundan, kurulum talimatlarına doğrudan bağlantı sağlanmayacaktır. RoboRIO'yu yapılandırma talimatları :ref:`docs/zero-to-robot/step-3/index:Step 3: Preparing Your Robot` sayfasında mevcuttur.

source: The image version in the documentation may not be updated yet. You should use the latest image available after installing the latest Beta Update.
tr_tr: Belgelerdeki görüntü sürümü henüz güncellenmemiş olabilir. En son Beta Güncellemesini yükledikten sonra mevcut en son görüntüyü kullanmalısınız.

source: Next verify the ability to create and download a basic robot program from the chosen template in the assigned programming language. This will verify that the development environment is set up correctly and working properly before moving on to a more complex system. For this task you should create, build and download a basic program to the roboRIO to run at startup, then verify that you are able to communicate with and enable the program using the Driver Station. Instructions can be found on the :ref:`docs/zero-to-robot/step-4/index:Step 4: Programming your Robot` page.
tr_tr: Ardından, atanan programlama dilinde seçilen şablondan temel bir robot programı oluşturma ve indirme yeteneğini doğrulayın. Bu, geliştirme ortamının doğru kurulduğunu ve daha karmaşık bir sisteme geçmeden önce düzgün çalıştığını doğrulayacaktır. Bu görev için, başlangıçta çalışması için roboRIO'ya temel bir program oluşturmalı, oluşturmalı ve indirmeli, ardından Driver Station kullanarak programla iletişim kurabildiğinizi ve programı etkinleştirebildiğinizi doğrulamalısınız. Talimatlar şu adreste bulunabilir: ref: `docs / zero-to-robota / step-4 / index: Step 4: Programming your Robot`.

source: Desired Feedback
tr_tr: İstenilen Geribildirim

source: Please keep the following questions in mind as you complete the task and include this information, as appropriate, in your Task 2 report.
tr_tr: Lütfen görevi tamamlarken aşağıdaki soruları aklınızda bulundurun ve bu bilgileri uygun şekilde Görev 2 raporunuza ekleyin.

source: What problems or difficulties did you encounter?
tr_tr: Ne tür sorunlar veya zorluklarla karşılaştınız?

source: What questions did you have during the process?
tr_tr: Süreç boyunca hangi sorularınız oldu?

source: Any specific suggestions on improving the documentation? (Were any instructions unclear?)
tr_tr: Dokümantasyonu iyileştirmek için herhangi bir özel öneriniz var mı? (Herhangi bir talimat net değil miydi?)

source: Is there anything else you want to tell us related to this task?
tr_tr: Bize bu görevle ilgili söylemek istediğiniz başka bir şey var mı?
