Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/tasks/task-4-new-features.po
Languages: es_mx, fr_ca, tr_tr

source: Task 4: Testing New Features
es_mx: Tarea 4: Probando Nuevas Funciones
fr_ca: Tâche 4 : tester de nouvelles fonctionnalités
tr_tr: Görev 4: Yeni Özellikleri Test Etme

source: Task: Test any new features or heavily modified code
es_mx: Tarea: Pruebe cualquier función nueva o código realmente modificado
fr_ca: Tâche : Tester toute les nouvelles fonctionnalités ou tout code modifié en profondeur
tr_tr: Görev: Yeni özellikleri veya büyük ölçüde değiştirilmiş kodları test edin

source: Overview
es_mx: Vista General
fr_ca: Aperçu
tr_tr: Genel Bakış

source: The purpose of this task is to test any newly developed or heavily modified features for the new season. This will help the Control System team find any bugs or issues with the new code. A complete description of changes for 2021 can be found in the :doc:`/docs/yearly-overview/yearly-changelog` document. Below is a list of some of the new or modified features to focus on:
es_mx: El propósito de esta tarea es probar cualquier característica recientemente desarrollada o muy modificada para la nueva temporada. Esto ayudará al equipo del Sistema de Control a encontrar errores o problemas con el nuevo código. Se puede encontrar una descripción completa de los cambios para 2021 en el documento :doc:`/docs/yearly-overview/yearly-changelog`. A continuación se muestra una lista de algunas de las funciones nuevas o modificadas en las que centrarse:
fr_ca: Le but de cette tâche est de tester toutes les fonctionnalités nouvellement développées ou modifiées en profondeur pour la nouvelle saison. Cela aidera l’équipe chargé du système de contrôle à trouver des bogues ou des problèmes avec le nouveau code. Une description complète des modifications pour 2021 se trouve dans le document :doc:`/docs/yearly-overview/yearly-changelog`. Vous trouverez ci-dessous une liste de quelques-unes des fonctionnalités nouvelles ou modifiées sur lesquelles vous concentrer :
tr_tr: Bu görevin amacı, yeni sezon için yeni geliştirilmiş veya büyük ölçüde değiştirilmiş özellikleri test etmektir. Bu, Kontrol Sistemi ekibinin yeni kodla ilgili herhangi bir hata veya sorunu bulmasına yardımcı olacaktır. 2021 için değişikliklerin tam bir açıklaması şu belgede bulunabilir :doc:`/docs/yearly-overview/yearly-changelog` belgesinde. Aşağıda odaklanılacak yeni veya değiştirilmiş özelliklerden bazılarının bir listesi bulunmaktadır:

source: :ref:`docs/software/wpilib-tools/robot-simulation/index:Robot Simulation` (including simulation UI, Mechanism2D and simulation physics classes. Additional SimGUI updates to come later in Beta)
es_mx: :ref:`docs/software/wpilib-tools/robot-simulation/index:Robot Simulation` (incluyendo simulación UI, Mechanism2D y clases de física de simulación. Actualizaciones adicionales de SimGUI vendrán más adelante en Beta)
fr_ca: :ref:`docs/software/wpilib-tools/robot-simulation/index:Robot Simulation` (y compris l'interface utilisateur de simulation, les classes Mechanism2D et simulation physique. Mises à jour additionnelles SimGUI à venir plus tard dans les tests Beta)
tr_tr: :ref:`docs/software/wpilib-tools/robot-simulation/index: Robot Simulation` (simülasyon UI, Mechanism2D ve simülasyon fizik sınıfları dahil. Beta'da daha sonra gelecek ek SimGUI güncellemeleri)

source: Robot Builder for New Command Based Framework (updated docs not yet available)
es_mx: Robot Builder para el Nuevo Marco Basado en Comandos (los documentos actualizados aún no están disponibles)
fr_ca: Robot Builder pour la nouvelle infrastructure orientée commande (documents mis à jour pas encore disponibles)
tr_tr: Yeni Komut Tabanlı Çerçeve için Robot Builder (güncellenmiş belgeler henüz mevcut değil)

source: Pathweaver update for reversed paths
es_mx: Actualización de Pathweaver para rutas invertidas
fr_ca: Pathweaver mis à jour pour intégrer le parcours des trajectoires inversées
tr_tr: Tersine çevrilmiş yollar için Pathweaver güncellemesi

source: :ref:`docs/software/wpilib-tools/robot-characterization/index:Robot Characterization` (heavily updated underneath)
es_mx: :ref:`docs/software/wpilib-tools/robot-characterization/index:Robot Characterization` (más actualizado debajo)
fr_ca: :ref:`docs/software/wpilib-tools/robot-characterization/index:Robot Characterization` (profondément mis à jour, plus bas)
tr_tr: :ref:`docs/software/wpilib-tools/robot-characterization/index:Robot Characterization` (altında yoğun şekilde güncellenmiştir)

source: Desired Feedback
es_mx: Retroalimentación Deseada
fr_ca: Rétroaction souhaitée
tr_tr: İstenilen Geribildirim

source: Please keep the following questions in mind as you complete the task and include this information, as appropriate, in your Task 3 report. If you competed with the robot at an offseason event, please mention that in your report (or write a separate short note if the event is after your main report)
es_mx: Por favor tenga en cuenta las siguientes preguntas al completar la tarea e incluya esta información, según corresponda, en su informe de la Tarea 3. Si compitió con el robot en un evento de offseason, mencione eso en su informe (o escriba una nota corta por separado si el evento es posterior a su informe principal)
fr_ca: Veuillez garder à l’esprit les questions suivantes lorsque vous terminez la tâche et inclure ces informations, le cas échéant, dans votre rapport relatif à la Tâche 3. Si vous avez fait de la compétition avec le robot lors d’un événement hors saison, veuillez le mentionner dans votre rapport (ou écrire une courte note distincte si l’événement est survenu après la rédaction de votre rapport principal)
tr_tr: Lütfen görevi tamamlarken aşağıdaki soruları aklınızda bulundurun ve bu bilgileri uygun şekilde Görev 3 raporunuza ekleyin. Robotla sezon dışı bir etkinlikte yarıştıysanız, lütfen raporunuzda bunu belirtin (veya etkinlik ana raporunuzdan sonraysa ayrı bir kısa not yazın)

source: Describe what features you tested and how you tested them.
es_mx: Describa que funciones probó y como las probó
fr_ca: Décrivez les fonctionnalités que vous avez testées et la façon dont vous les avez testées.
tr_tr: Hangi özellikleri test ettiğinizi ve bunları nasıl test ettiğinizi açıklayın.

source: Describe any bugs you encountered.
es_mx: Describa cualquier error que haya encontrado.
fr_ca: Décrivez tous les bogues que vous avez rencontrés.
tr_tr: Karşılaştığınız hataları açıklayın.

source: What problems or difficulties did you encounter?
es_mx: ¿Qué problemas o dificultades encontró?
fr_ca: Quels problèmes ou difficultés avez-vous rencontrés?
tr_tr: Ne tür sorunlar veya zorluklarla karşılaştınız?

source: What questions did you have during the process?
es_mx: ¿Qué preguntas tuvo durante el proceso?
fr_ca: Quelles questions vous êtes-vous posé au cours du processus?
tr_tr: Süreç boyunca hangi sorularınız oldu?

source: Any specific suggestions on improving the documentation? (Were any instructions unclear?)
es_mx: ¿Alguna sugerencia específica para mejorar la documentación? (¿Alguna instrucción no estaba clara?)
fr_ca: Des suggestions spécifiques quant à l’amélioration de la documentation? (avez-vous rencontré des instructions pas suffisemment claires?)
tr_tr: Dokümantasyonu iyileştirmek için herhangi bir özel öneriniz var mı? (Herhangi bir talimat net değil miydi?)

source: Is there anything else you want to tell us related to this task?
es_mx: ¿Hay algo más que nos quiera decir relacionado con esta tarea?
fr_ca: Y a-t-il autre chose que vous voulez nous mentionner en rapport avec cette tâche?
tr_tr: Bize bu görevle ilgili söylemek istediğiniz başka bir şey var mı?
