Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/tasks/task-1-software-install.po
Languages: es_mx, fr_ca, tr_tr

source: Task 1: Software Installation
es_mx: Tarea 1: Instalación del Software
fr_ca: Tâche 1: Installation du logiciel
tr_tr: Görev 1: Yazılım Kurulumu

source: Task: Choose, acquire, and install the software required for developing FRC software in the language you have been assigned (C++, Java or LabVIEW).
es_mx: Tarea: Escoja, adquiera e instale el software requerido para desarrollar el software de FRC en el leguaje que se le ha asignado (C++, Java o LabVIEW).

source: Overview
es_mx: Vista General
fr_ca: Aperçu
tr_tr: Genel Bakış

source: The FRC Control System can be programmed in LabVIEW, Java or C/C++. Teams should use the language they have been assigned for the Beta test.
es_mx: El Sistema de Control de FRC puede ser programado en LabVIEW, Java o C/C++. Los equipos deben usar el lenguaje que se les ha asignado para la prueba Beta.
fr_ca: Le système de contrôle FRC peut être programmé en LabVIEW, Java ou C/C++. Les équipes doivent utiliser le langage qui leur a été attribué pour le test bêta.
tr_tr: FRC Kontrol Sistemi LabVIEW, Java veya C / C ++ ile programlanabilir. Takımlar, Beta testi için kendilerine atanan dili kullanmalıdır.

source: Documentation for installation can be found on the :ref:`docs/zero-to-robot/step-2/index:Step 2: Installing Software` page.
es_mx: La documentación para la instalación se puede encontrar en la página :ref:`docs/zero-to-robot/step-2/index:Step 2: Installing Software`.
fr_ca: La documentation pour l'installation se trouve sur la page :ref:`docs/zero-to-robot/step-2/index:Step 2: Installing Software` .
tr_tr: Kurulum için dokümantasyon :ref:`docs/zero-to-robot/step-2/index:Step 2: Installing Software` sayfasında bulunabilir.

source: For the 2021 FRC season, LabVIEW will be remaining at the same version used in the 2020 FRC season. Teams do not need to un-install or re-install the base LabVIEW installation (you will still need to install updated Game Tools). There will be re-licensing instructions coming later that we may ask teams to test.
es_mx: Para la temporada 2021 de FRC, LabVIEW permanecerá en la misma versión utilizada en la temporada 2020 FRC. Los equipos no necesitan desinstalar o reinstalar la instalación base de LabVIEW (aún necesitará instalar las Herramientas de Juego actualizadas). Más adelante, habrá instrucciones para volver a obtener la licencia que podemos pedir a los equipos que prueben.
fr_ca: Pour la saison FRC 2021, LabVIEW restera dans la même version utilisée lors de la saison FRC 2020. Les équipes n'ont pas besoin de désinstaller ou de réinstaller l'installation de base de LabVIEW (vous devrez toujours installer les outils de jeu mis à jour). Il y aura des instructions de renouvellement de licence plus tard que nous pourrions demander aux équipes de tester.
tr_tr: 2021 FRC sezonu için LabVIEW, 2020 FRC sezonunda kullanılan sürümde kalacaktır. Ekiplerin temel LabVIEW kurulumunu kaldırmasına veya yeniden yüklemesine gerek yoktur (yine de güncellenmiş Oyun Araçlarını yüklemeniz gerekecektir). Ekiplerden test etmelerini isteyebileceğimiz yeniden lisanslama talimatları daha sonra gelecek.

source: Desired Feedback
es_mx: Retroalimentación Deseada
fr_ca: Commentaires souhaités
tr_tr: İstenilen Geribildirim

source: Please keep the following questions in mind as you complete the task and include this information, as appropriate, in your Task 1 report.
es_mx: Por favor tenga las siguientes preguntas en la mente mientras completa las tareas e incluye esta información, como es apropiado, en su reporte de Tarea 1.
fr_ca: Veuillez garder les questions suivantes à l'esprit lorsque vous accomplissez la tâche et incluez ces informations, le cas échéant, dans votre rapport de tâche 1.
tr_tr: Lütfen görevi tamamlarken aşağıdaki soruları aklınızda bulundurun ve bu bilgileri uygun şekilde Görev 1 raporunuza ekleyin.

source: What problems or difficulties did you encounter?
es_mx: ¿Qué problemas o dificultades encontró?
fr_ca: Quels problèmes ou difficultés avez-vous rencontrés?
tr_tr: Ne tür sorunlar veya zorluklarla karşılaştınız?

source: If there were issues - What was the configuration of the computer(s) on which you installed the software? (System memory, operating system version)
es_mx: Si hay problemas - ¿Cuál fue la configuración de la computadora(s) en donde instaló el software? (Memoria del sistema, versión del sistema operativo)
fr_ca: S'il y a eu des problèmes - Quelle était la configuration du ou des ordinateurs sur lesquels vous avez installé le logiciel? (Mémoire système, version du système d'exploitation)
tr_tr: Sorunlar varsa - Yazılımı kurduğunuz bilgisayar(ların) yapılandırması neydi? (Sistem belleği, işletim sistemi sürümü)

source: What questions did you have during the process?
es_mx: ¿Qué preguntas surgieron durante el proceso?
fr_ca: Quelles questions aviez-vous pendant le processus?
tr_tr: Süreç boyunca hangi sorularınız oldu?

source: Any specific suggestions on improving the documentation? (Were any instructions unclear?)
es_mx: ¿Alguna sugerencia específica para mejorar la documentación? (¿Algunas instrucciones no fueron claras?)
fr_ca: Des suggestions spécifiques pour améliorer la documentation? (Certaines instructions n'étaient-elles pas claires?)
tr_tr: Dokümantasyonu iyileştirmek için herhangi bir özel öneriniz var mı? (Herhangi bir talimat net değil miydi?)

source: Is there anything else you want to tell us related to this task?
es_mx: ¿Existe alguna otra cosa que nos quiera decir relacionada a esta tarea?
fr_ca: Voulez-vous nous dire autre chose concernant cette tâche?
tr_tr: Bize bu görevle ilgili söylemek istediğiniz başka bir şey var mı?

source: For this task, there is supplemental documentation provided in TeamForge for all languages. See the Documents and File Releases sections on TeamForge. Use the files in the File Releases sections instead of the files linked in the installation documentation.
fr_ca: Pour cette tâche, une documentation supplémentaire est fournie dans TeamForge pour toutes les langues. Consultez les sections Documents et Communiqués de fichiers sur TeamForge. Utilisez les fichiers des sections File Releases au lieu des fichiers liés dans la documentation d'installation.
tr_tr: Bu görev için, TeamForge'da tüm diller için sağlanan ek belgeler bulunmaktadır. TeamForge'daki Belgeler ve Dosya Yayınları bölümlerine bakın. Kurulum belgelerinde bağlantısı verilen dosyalar yerine Dosya Yayınları bölümlerindeki dosyaları kullanın.
