Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/romi-robot/imaging-romi.po
Languages: he_il

source: Imaging your Romi
he_il: צריבת ה-Romi

source: We are working hard on getting the Romi documentation complete. Please check back later.
he_il: אנו עובדים קשה על השלמת התיעוד עבור Romi. אנא חזרו מאוחר יותר.

source: The Romi has 2 boards that both need to be imaged in order for the robot to work – the Raspberry Pi and the Romi 32U4 Control Board. Once the Raspberry Pi is imaged, we can use the web dashboard included on the device to image the 32U4 Control Board.
he_il: ל-Romi יש שני לוחות ששניהם צריכים להיות צרובים על מנת שהרובוט יעבוד - ה-Raspberry Pi וה-Romi 32U4 Control Board. לאחר צריבת ה-Raspberry Pi, נוכל להשתמש ב-Dashboard האינטרנטי הכלול במכשיר כדי לצרוב את ה-32U4 Control Board.

source: Download
he_il: הורדה

source: The Raspberry Pi Romi image is built on top of WPILibPi.
he_il: מערכת ההפעלה Raspberry Pi Romi בנויה על גבי WPILibPi.

source: Please ensure you download the Romi version and not the standard release of WPILibPi. The Romi version is suffixed with ``-Romi``. See the below image for an example.
he_il: אנא וודאו כי אתם מורידים את גרסת Romi ולא את הגרסה הסטנדרטית של WPILibPi. גרסת ה-Romi מסתיימת עם ``-Romi``. ראו את התמונה למטה לדוגמא.

source: Imaging
he_il: צריבה

source: Imaging is identical to the standard :doc:`WPILibPi Installation </docs/software/vision-processing/wpilibpi/installing-the-image-to-your-microsd-card>`.
he_il: הצריבה זהה עם :doc:`התקנת WPILibPi </docs/software/vision-processing/wpilibpi/installing-the-image-to-your-microsd-card>`.

source: Wireless Network Setup
he_il: הגדרת רשת אלחוטית

source: After turning the Romi on, connect to the WiFi SSID ``WPILibPi`` with the WPA2 passphrase ``WPILib2021!``. Open a web browser and connect to either ``http://10.0.0.2/`` or http://wpilibpi.local/ to open the web dashboard.
he_il: לאחר הדלקת ה-Romi, התחברו לרשת ``WPILibPi`` עם הסיסמה ``WPILib2021!``. פתחו דפדפן אינטרנט ועברו אל ``http://10.0.0.2/`` או ``http://wpilibpi.local/`` כדי לפתוח את ה-Dashboard האינטרנטי.
