Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/smartdashboard/displaying-expressions.po
Languages: tr_tr

source: Displaying Expressions from a Robot Program
tr_tr: Bir Robot Programından İfadelerin Görüntülenmesi

source: Often debugging or monitoring the status of a robot involves writing a number of values to the console and watching them stream by. With SmartDashboard you can put values to a GUI that is automatically constructed based on your program. As values are updated, the corresponding GUI element changes value - there is no need to try to catch numbers streaming by on the screen.
tr_tr: Genellikle bir robotun durumunun hataların ayırt edilmesi veya izlenmesi, konsola bir dizi değer yazmayı ve bunların akışını izlemeyi içerir. SmartDashboard ile, programınıza bağlı olarak otomatik olarak oluşturulan bir GUI'ye değerler koyabilirsiniz. Değerler güncellendikçe, karşılık gelen GUI öğesi değer değiştirir - ekranda çıkan sayıları yakalamaya gerek yoktur.

source: Writing Values to SmartDashboard
tr_tr: SmartDashboard değerlerini yazmak

source: You can write Boolean, Numeric, or String values to the SmartDashboard by simply calling the correct method for the type and including the name and the value of the data, no additional code is required. Any time in your program that you write another value with the same name, it appears in the same UI element on the screen on the driver station or development computer. As you can imagine this is a great way of debugging and getting status of your robot as it is operating.
tr_tr: Yalnızca tür için doğru yöntemi çağırarak ve verilerin adını ve değerini dahil ederek SmartDashboard'a Boolean, Numeric veya String değerleri yazabilirsiniz, ek kod gerekmez. Programınızda aynı adla başka bir değer yazdığınız her an, driver stationda veya geliştirme bilgisayarında ekranda aynı UI öğesinde görünür. Tahmin edebileceğiniz gibi bu, robotunuz çalışırken hata ayıklamanın ve durumunu almanın harika bir yoludur.

source: Creating Widgets on SmartDashboard
tr_tr: SmartDashboard'da Widget'lar Oluşturma

source: Widgets are populated on the SmartDashboard automatically, no user intervention is required. Note that the widgets are only populated when the value is first written, you may need to enable your robot in a particular mode or trigger a particular code routine for an item to appear. To alter the appearance of the widget, see the next two sections :doc:`Changing the Display Properties of a Value <changing-display-properties>` and :doc:`Changing the Display Widget Type for a Value <changing-display-widget-type>`.
tr_tr: Widget'lar SmartDashboard'a otomatik olarak yerleştirilir, herhangi bir kullanıcı müdahalesi gerekmez. Widget'ların yalnızca değer ilk yazıldığında doldurulduğunu unutmayın, robotunuzu belirli bir modda etkinleştirmeniz veya bir öğenin görünmesi için belirli bir kod rutinini tetiklemeniz gerekebilir. Widget'ın görünümünü değiştirmek için sonraki iki bölüme bakın: doc: `` Bir Değerin Görüntü Özelliklerini Değiştirme '' ve: doc: `` Bir Değer için Ekran Widget Türünü Değiştirme ''.

source: Stale Data
tr_tr: Eski Veri

source: SmartDashboard uses NetworkTables for communicating values between the robot and the driver station laptop. Network Tables acts as a distributed table of name and value pairs. If a name/value pair is added to either the client (laptop) or server (robot) it is replicated to the other. If a name/value pair is deleted from, say, the robot but the SmartDashboard or OutlineViewer are still running, then when the robot is restarted, the old values will still appear in the SmartDashboard and OutlineViewer because they never stopped running and continue to have those values in their tables. When the robot restarts, those old values will be replicated to the robot.
tr_tr: SmartDashboard, robot ve sürücü istasyonu dizüstü bilgisayarı arasındaki değerleri iletmek için NetworkTables kullanır. Ağ Tabloları, ad ve değer çiftlerinden oluşan dağıtılmış bir tablo görevi görür. İstemciye (dizüstü bilgisayar) veya sunucuya (robot) bir ad / değer çifti eklenirse, diğerine kopyalanır. Örneğin robottan bir ad / değer çifti silindiyse, ancak SmartDashboard veya OutlineViewer hala çalışıyorsa, robot yeniden başlatıldığında, eski değerler SmartDashboard ve OutlineViewer'da görünmeye devam eder çünkü çalışmayı asla durdurmazlar ve bu değerler tablolarında. Robot yeniden başladığında, bu eski değerler robota kopyalanacaktır.

source: To ensure that the SmartDashboard and OutlineViewer are showing current values, it is necessary to restart the network table clients and robot at the same time. That way, old values that one is holding won't get replicated to the others.
tr_tr: SmartDashboard ve OutlineViewer'ın mevcut değerleri göstermesini sağlamak için, ağ tablosu istemcilerini ve robotu aynı anda yeniden başlatmak gerekir. Bu şekilde, birinin sahip olduğu eski değerler diğerlerine kopyalanmayacaktır.

source: This usually isn't a problem if the program isn't constantly changing, but if the program is in development and the set of keys being added to NetworkTables is constantly changing, then it might be necessary to do the restart of everything to accurately see what is current.
tr_tr: Program sürekli değişmiyorsa bu genellikle bir sorun değildir, ancak program geliştirme aşamasındaysa ve NetworkTables'a eklenen anahtar seti sürekli değişiyorsa, doğru bir şekilde görmek için her şeyin yeniden başlatılması gerekebilir.
