Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/beta-getting-started/accessing-the-beta-project.po
Languages: es_mx, tr_tr, zh_cn

source: Accessing the Beta Project
es_mx: Accediendo al Proyecto Beta
tr_tr: Beta Projesine Erişim
zh_cn: 访问 Beta 项目

source: Only accepted Beta Test teams will have access to the Beta project.
es_mx: Solo los equipos de prueba beta aceptados tendrán acceso al proyecto beta.
tr_tr: Beta projesine yalnızca kabul edilen Beta Test ekipleri erişebilir.
zh_cn: 只有接受了 Beta 测试的队伍才可访问 Beta 项目。

source: The members identified by your team to communicate with *FIRST*\ |reg| technical staff will have access to the Beta Test project on the `<https://usfirst.collab.net>`__ site.
es_mx: Los miembros identificados por su equipo para comunicarse con el staff técnico de *FIRST*\ |reg| tendrán acceso al proyecto de en el sitio `<https://usfirst.collab.net>`__.
tr_tr: Ekibiniz tarafından * FIRST * \ |reg| ile iletişim kurmak için belirlenen üyeler teknik personel `<https://usfirst.collab.net>`__ sitesindeki Beta Test projesine erişebilecek.

source: Signing In
es_mx: Iniciando sesión
tr_tr: Giriş yapılıyor
zh_cn: 注册登录

source: Open your web browser and browse to `<https://usfirst.collab.net>`__. Near the top left corner of the page enter the username and password provided in the Beta test email you received, then click "Log In".
es_mx: Abra su navegador web y busque `<https://usfirst.collab.net>`__. Cerca de la esquina superior izquierda de la página, ingrese el nombre de usuario y la contraseña proporcionados en el correo electrónico de prueba Beta que recibió, luego haga clic en "Iniciar sesión".
tr_tr: Web tarayıcınızı açın ve `<https://usfirst.collab.net>`__. 'a gidin. Sayfanın sol üst köşesine yakın bir yerde, aldığınız Beta test e-postasında verilen kullanıcı adını ve şifreyi girin, ardından "Oturum Aç" ı tıklayın.
zh_cn: 打开您的网络浏览器，然后进入 `<https://usfirst.collab.net>`__ 。在页面左上角，输入您收到的 Beta Test 电子邮件中所提供的用户名和密码，然后单击“登录”。

source: Opening the Beta Project
es_mx: Abriendo el Proyecto Beta
tr_tr: Beta Projesini Açmak
zh_cn: 打开 Beta 项目

source: Your user account should already be added to the Beta Project. To view the project:
es_mx: Su cuenta de usuario ya debería estar agregada al Proyecto Beta. Para ver el proyecto:
tr_tr: Kullanıcı hesabınız zaten Beta Projesine eklenmiş olmalıdır. Projeyi görüntülemek için:
zh_cn: 您的用户账号应该已经添加到 Beta 项目中了。如需查看项目：

source: Click the Projects tab on the top navigation ribbon.
es_mx: Haga clic en la pestaña Proyectos en la cinta de navegación superior.
tr_tr: Üst gezinme şeridindeki Projeler sekmesine tıklayın.
zh_cn: 请单击顶部导航功能区的 Projects 按键

source: Then click on ``FRC20**Beta`` in the projects list (image of 2015 as an example).
es_mx: Luego haga clic en ``FRC20**Beta`` en la lista de proyectos (imagen de 2015 como ejemplo).
tr_tr: Ardından projeler listesinde ``FRC20**Beta`` üzerine tıklayın (örnek olarak 2015 resmi).
zh_cn: 然后单击 Projects 一览表中的“FRC20**Beta”（图片以 2015 作为示例）

source: The Project Homepage
es_mx: La página de inicio del proyecto
tr_tr: Proje Ana Sayfası
zh_cn: 项目主页

source: The project homepage contains some statistics and Project News. Throughout the beta, the Project News section may be updated with the latest information from the *FIRST* technical staff. The top ribbon contains tabs allowing you to navigate to the different sections of the project:
es_mx: La página de inicio del proyecto contiene algunas estadísticas y noticias del proyecto. A lo largo de la versión beta, la sección de Noticias del proyecto puede actualizarse con la información más reciente del personal técnico de *FIRST*. La cinta superior contiene pestañas que le permiten navegar a las diferentes secciones del proyecto:
tr_tr: Proje ana sayfası bazı istatistikler ve Proje Haberleri içerir. Beta boyunca, Proje Haberleri bölümü *FIRST* teknik personelinin en son bilgileriyle güncellenebilir. Üst şerit, projenin farklı bölümlerine gitmenizi sağlayan sekmeler içerir:

source: Trackers - The Trackers tab is where the bug tracker for the project is located.
es_mx: Trackers - La pestaña de Trackers es donde se localiza un rastreador de bugs para el proyecto.
tr_tr: İzleyiciler - İzleyiciler sekmesi, proje için hata izleyicinin bulunduğu yerdir.

source: File Releases - The File Releases tab will host any files you will need to download as part of the Beta test process such as NI FRC\ |reg| Game Tools files.
es_mx: Publicaciones de archivos - la pestaña File Releases alojará cualquier archivo que necesite descargar como parte del proceso de prueba Beta, como documentos NI FRC\ |reg| Game Tools.
tr_tr: Dosya Yayınları - Dosya Yayınları sekmesi, NI FRC\ |reg| Game Tools dosyaları gibi Beta test sürecinin bir parçası olarak indirmeniz gereken tüm dosyaları barındırır.
zh_cn: 文件发布 - “文件发布”选项将包括所有在 Beta 测试中需要下载的文件，例如 NI FRC® Game Tools 文件。

source: Documents - the Documents tab will contain any documents to be distributed to Beta teams. Much of the documentation for the Beta test will be located on the FRC Docs site but there may still be documents posted here as well.
es_mx: Documentos - la pestaña de Documentos contendrá cualquier documento que se distribuya a los equipos Beta. Gran parte de la documentación para la prueba Beta estará localizada en el sitio de FRC Docs, pero puede que todavía haya documentos publicados aquí también.
tr_tr: Belgeler - Belgeler sekmesi Beta ekiplerine dağıtılacak tüm belgeleri içerecektir. Beta testi ile ilgili belgelerin çoğu FRC Dokümanlar sitesi, ancak yine de burada yayınlanan dokümanlar olabilir.
zh_cn: 文档 - “文档”选项将包括所有要分给 Beta 队伍的文件。虽然许多 Beta 测试的文件都在 FRC Docs网站上了，但仍可能有文档被发布在这里。

source: Discussions - The Discussions tab contains a forum which will allow teams to post questions or discussions about the Beta test, software or documentation. Task reports will also be posted here.
es_mx: Discussions - La pestaña de discusiones contiene un foro donde se le permitirá a los equipos publicar preguntas o discusiones acerca de la prueba Beta, software o documentación. Los reportes de Tareas también serán publicados aquí.
tr_tr: Tartışmalar - Tartışmalar sekmesi, ekiplerin Beta testi, yazılım veya belgeler hakkında sorular veya tartışmalar yayınlamasına olanak tanıyan bir forum içerir. Görev raporları da burada yayınlanacaktır.
