Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/beta-getting-started/monitoring-via-email-notifications.po
Languages: tr_tr

source: Monitoring Via Email Notifications
tr_tr: E-posta Bildirimleriyle İzleme

source: You may wish to monitor specific items or even whole sections of the Beta project via email. TeamForge has a large degree of flexibility in setting up e-mail monitoring.
tr_tr: E-posta yoluyla belirli öğeleri ve hatta Beta projesinin tüm bölümlerini izlemek isteyebilirsiniz. TeamForge, e-posta izleme kurulumunda büyük ölçüde esnekliğe sahiptir.

source: Monitoring Individual Items
tr_tr: Tek Tek Öğeleri İzleme

source: You can choose to monitor a number of different individual items (forum threads, tracker artifacts, file releases, etc.) via e-mail. Items that can be subscribed to will have a Monitor button located at the bottom of the screen. Clicking this button will subscribe you to the item and notify you of changes via e-mail. To unsubscribe, click the Stop Monitoring button (which will replace the Monitor button when you are subscribed).
tr_tr: E-posta yoluyla bir dizi farklı öğeyi (forum konuları, izleyici yapıları, dosya sürümleri, vb.) İzlemeyi seçebilirsiniz. Abone olunabilecek öğelerde, ekranın alt kısmında bulunan bir Monitor düğmesi bulunur. Bu düğmeyi tıklamak sizi öğeye abone olacak ve değişiklikleri e-posta yoluyla size bildirecektir. Aboneliğinizi iptal etmek için, Stop Monitoring düğmesine tıklayın (abone olduğunuzda Monitör düğmesinin yerini alacaktır).

source: Monitoring Folders
tr_tr: Klasörleri İzleme

source: "Folders" (discussion sections, trackers, etc.) can also be monitored via e-mail. To monitor a folder click the dropdown arrow next to the Monitor button and select Monitor Current Folder.
tr_tr: "Folders" (tartışma bölümleri, trackers, vb.) E-posta yoluyla da izlenebilir. Bir klasörü izlemek için Monitor düğmesinin yanındaki açılır oka tıklayın ve Monitor Current Folder seçin.

source: Monitoring Project Sections
tr_tr: Proje Bölümlerini İzleme

source: It is also possible to set up for entire sections of the site. To set up this monitoring:
tr_tr: Sitenin tüm bölümleri için kurulum yapmak da mümkündür. Bu izlemeyi kurmak için:

source: Click My Workspace
tr_tr: My Workspace'e tıklayın

source: Click on the Monitoring Tab
tr_tr: Monitoring Sekmesine tıklayın

source: Select the project from the list on the left
tr_tr: Soldaki listeden projeyi seçin

source: Click on the Monitored Applications tab
tr_tr: Monitores Applications sekmesine tıklayın

source: Check the box for any section you wish to subscribe to
tr_tr: Abone olmak istediğiniz herhangi bir bölümün kutusunu işaretleyin

source: Click Save
tr_tr: Kaydet'e tıklayın

source: Monitoring Settings
tr_tr: İzleme Ayarları

source: You can set your overall notification settings to e-mail you per change or to send you a daily digest email with all changes. To do this:
tr_tr: Genel bildirim ayarlarınızı, her değişiklik için size e-posta gönderecek veya size tüm değişiklikleri içeren günlük bir özet e-postası gönderecek şekilde ayarlayabilirsiniz. Bunu yapmak için:

source: Click My Settings
tr_tr: My Settings'e tıklayın

source: Select the desired setting
tr_tr: İstenilen ayarı seçin

source: Per Section Notification Settings
tr_tr: Bölüm Başına Bildirim Ayarları

source: You can also customize notifications on a per section basis. To do this:
tr_tr: Ayrıca bildirimleri bölüm bazında özelleştirebilirsiniz. Bunu yapmak için:

source: Click Monitoring
tr_tr: Monitoring'e tıklayın

source: Click on the FRC20**Beta project on the left side
tr_tr: Sol taraftaki FRC20**Beta projesine tıklayın

source: Select the Email Notification Preferences tab
tr_tr: Email Notification Preferences sekmesini seçin

source: Change the settings for any section of the project you wish to have override your base settings.
tr_tr: Temel ayarlarınızı geçersiz kılmak istediğiniz projenin herhangi bir bölümü için ayarları değiştirin.
