Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/beta/beta-getting-started/trackers-reporting-bugs.po
Languages: tr_tr

source: Trackers - Reporting Bugs
tr_tr: İzleyiciler - Raporlama Hataları

source: While we will certainly accept and respond to bugs in either location, we would prefer bugs for WPILib C++/Java components (libraries, VS Code, Shuffleboard, etc.) be submitted to the appropriate `GitHub repositories <https://github.com/wpilibsuite>`__.
tr_tr: Her iki konumda da hataları kesinlikle kabul edip yanıtlasak da, WPILib C ++ / Java bileşenleri (kitaplıklar, VS Code, Shuffleboard, vb.) İçin hataların uygun `GitHub repositories <https://github.com/wpilibsuite>`__ gönderilmesini tercih ederiz.

source: Teamforge Bug Tracker
tr_tr: Teamforge Hata İzleyici

source: The bug tracker is used for reporting bugs you discover in WPILib or other FRC software. If you are not sure if particular behavior is a bug or not, err on the side of reporting the bug (or at least posting in the Discussion section).
tr_tr: Hata izleyici, WPILib veya diğer FRC yazılımlarında keşfettiğiniz hataları bildirmek için kullanılır. Belirli bir davranışın bir hata olup olmadığından emin değilseniz, hatayı bildirirken hata yapın (veya en azından Tartışma bölümünde yayınlayın).

source: On the Trackers tab, click on Bugs to reach the Bug Tracker. To Submit a new bug, click Submit New Artifact. The fields of the artifact are:
tr_tr: İzleyiciler sekmesinde, Hata İzleyiciye ulaşmak için Hatalar'a tıklayın. Yeni bir hata göndermek için Yeni Yapı Gönder'i tıklayın. Yapının alanları şunlardır:

source: Title - Give your bug a meaningful title which describes the issue
tr_tr: Başlık - Hatanıza sorunu açıklayan anlamlı bir başlık verin

source: Description - Describe the bug including observed behavior, expected behavior and steps to reproduce
tr_tr: Açıklama - Gözlenen davranış, beklenen davranış ve yeniden üretme adımları dahil olmak üzere hatayı açıklayın

source: Reported By - Enter your TeamForge user name or click the silhouette to open the selector where you can select your username.
tr_tr: Bildiren - TeamForge kullanıcı adınızı girin veya kullanıcı adınızı seçebileceğiniz seçiciyi açmak için siluete tıklayın.

source: Category - Select the appropriate affected software from the dropdown list (LabVIEW WPILib, Java WPILib, Driver Station, etc.)
tr_tr: Kategori - Açılır listeden uygun etkilenen yazılımı seçin (LabVIEW WPILib, Java WPILib, Driver Station, vb.)

source: Reported in Release - Select which version of the file you were using, if available.
tr_tr: Sürümde Bildirildi - Varsa, kullanmakta olduğunuz dosyanın hangi sürümünü seçin.

source: Priority - If desired you may estimate a priority based on bug severity. Leaving at the default priority does not mean the bug will not be addressed. -All new bugs are analyzed by the Control System team and assigned an appropriate priority.
tr_tr: Öncelik - İstenirse, hatanın ciddiyetine göre bir öncelik tahmin edebilirsiniz. Varsayılan önceliğin bırakılması, hatanın ele alınmayacağı anlamına gelmez. -Tüm yeni hatalar Kontrol Sistemi ekibi tarafından analiz edilir ve uygun bir öncelik atanır.

source: Status - When reporting a new bug this should be left as Open.
tr_tr: Durum - Yeni bir hata bildirirken, bu Açık olarak bırakılmalıdır.

source: Assigned To - When reporting a bug this should be left blank. The Control System team uses this field to indicate who is working on a given artifact.
tr_tr: Atanan - Bir hata bildirirken bu boş bırakılmalıdır. Kontrol Sistemi ekibi, belirli bir yapı üzerinde kimin çalıştığını belirtmek için bu alanı kullanır.

source: Attachment - Attach any additional file that may be appropriate, examples of appropriate files would be a patch for the bug, code to reproduce the bug (single file or zip) or an image of the bug (if appropriate/necessary).
tr_tr: Ek - Uygun olabilecek herhangi bir ek dosyayı ekleyin, uygun dosyaların örnekleri, hata için bir yama, hatayı yeniden oluşturmak için kod (tek dosya veya zip) veya hatanın bir görüntüsü (uygunsa / gerekliyse) olabilir.

source: GitHub Issues
tr_tr: GitHub Sorunları

source: For bugs in WPILib C++/Java/Java dashboards/etc., please locate the appropriate repository from the `WPILibSuite GitHub <https://github.com/wpilibsuite>`__ organization and report the bug there. To Report a bug, click the **Issues** tab and select **New issue**.
tr_tr: WPILib C ++ / Java / Java panoları / vb .'deki hatalar için lütfen `WPILibSuite GitHub <https://github.com/wpilibsuite>`__ organizasyonundan uygun depoyu bulun ve hatayı orada bildirin. Hata bildirmek için ** Sorunlar ** sekmesini tıklayın ve ** Yeni sorun ** seçeneğini seçin.

source: Fill out a title and description of the bug, then click **Submit new issue**.
tr_tr: Hatanın başlığını ve açıklamasını girin, ardından ** Yeni sorun gönder ** 'i tıklayın.
