Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/introduction/robotbuilder-operator-interface-to-command.po
Languages: tr_tr

source: Connecting the Operator Interface to a Command
tr_tr: Operatör Arayüzünü Bir Komuta Bağlama

source: RobotBuilder has been updated to support the new commandbased framework! Unfortunately, this documentation is outdated and only for the old commandbased framework. Individuals interested in updating this documentation can open a pull request on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository.
tr_tr: RobotBuilder, yeni komut tabanlı çerçeveyi desteklemek için güncellendi! Ne yazık ki, bu dokümantasyon güncelliğini yitirmiştir ve yalnızca eski komut temelli çerçeve içindir. Bu dokümantasyonu güncellemekle ilgilenen kişiler, "frc-docs <https://github.com/wpilibsuite/frc-docs>" __ deposuna destekte bulunabilirler.

source: Commands handle the behaviors for your robot. The command starts a subsystem to some operating mode like raising and elevator and continues running until it reaches some setpoint or timeout. The command then handles waiting for the subsystem to finish. That way commands can run in sequence to develop more complex behaviors.
tr_tr: Komutlar, robotunuzun davranışlarını ele alır. Komut, kaldırma ve asansör gibi bazı çalışma modlarına bir alt sistem başlatır ve bir ayar noktasına veya zaman aşımına ulaşana kadar çalışmaya devam eder. Komut daha sonra alt sistemin bitmesini beklemeyi işler. Bu şekilde komutlar, daha karmaşık davranışlar geliştirmek için sırayla çalışabilir.

source: RobotBuilder will also generate code to schedule a command to run whenever a button on your operator interface is pressed. You can also write code to run a command when a particular trigger condition has happened.
tr_tr: RobotBuilder ayrıca, operatör arayüzünüzdeki bir düğmeye her basıldığında çalıştırılacak bir komut programlamak için kod oluşturacaktır. Ayrıca, belirli bir tetikleme koşulu gerçekleştiğinde bir komutu çalıştırmak için kod yazabilirsiniz.

source: Run a Command with a Button Press
tr_tr: Düğmeye Basılarak Komut Çalıştırın

source: In this example we want to schedule the "Move Elevator" command to run whenever joystick button 1 is pressed.
tr_tr: Bu örnekte, joystick düğmesi 1'e her basıldığında çalışacak "Move Elevator-Kaldırıcı hareketi" komutunu programlamak istiyoruz.

source: The command to run is called "Move Elevator" and its function is to move the elevator on the robot to the top position
tr_tr: Çalıştırma komutu "Move Elevator-Kaldırıcı hareketi" olarak adlandırılır ve işlevi robot üzerindeki kaldırıcıyı en üst konuma taşımaktır.

source: Notice that the command requires the Elevator subsystem. This will ensure that this command starts running even if there was another operation happening at the same time that used the elevator. In this case the previous command would be interrupted.
tr_tr: Komutun Elevator alt sistemini gerektirdiğine dikkat edin. Bu, aynı zamanda kaldırıcı kullanan başka bir işlem olsa bile bu komutun çalışmaya başlamasını sağlayacaktır. Bu durumda önceki komut kesintiye uğrayacaktır.

source: Parameters make it possible for one command to do multiple things; presets let you define values you pass to the command and reuse them
tr_tr: Parametreler, bir komutun birden çok şey yapmasını mümkün kılar; hazır ayarlar, komuta ilettiğiniz değerleri tanımlamanıza ve bunları yeniden kullanmanıza izin verir

source: Adding the Joystick to the Robot Program
tr_tr: Joystick'i Robot Programına Ekleme

source: Add the joystick to the robot program
tr_tr: Joystick'i robot programına ekleyin

source: Drag the joystick to the Operator Interface folder in the robot program
tr_tr: Kumanda çubuğunu robot programındaki Operatör Arayüzü klasörüne sürükleyin

source: Name the joystick so that it reflects the use of the joystick and set the USB port number
tr_tr: Joystick'i, joystick kullanımını yansıtacak şekilde adlandırın ve USB port numarasını ayarlayın

source: Linking a Button to the "Move Elevator" Command
tr_tr: Bir Düğmeyi "Move Elevator-Kaldırıcı hareketi" Komutuna Bağlama

source: Add the button that should be pressed to the program
tr_tr: Programa basılması gereken butonu ekleyin

source: Drag the joystick button to the Joystick (Driver gamepad) so that it's under the joystick
tr_tr: Joystick düğmesini, joystick'in altına gelecek şekilde Joystick'e (Sürücü gamepad) sürükleyin

source: Set the properties for the button: the button number, the command to run when the button is pressed, parameters the command takes, and the "When to run" property to "whenPressed" to indicate that the command should run whenever the joystick button is pressed.
tr_tr: Düğmenin özelliklerini ayarlayın: düğme numarası, düğmeye basıldığında çalıştırılacak komut, komutun aldığı parametreler ve kumanda kolu düğmesi her çalıştırıldığında komutun çalışması gerektiğini belirtmek için "When to run" özelliği "WhenPressed" olarak ayarlayın..

source: Joystick buttons must be dragged to (under) a Joystick. You must have a joystick in the Operator Interface folder before adding buttons.
tr_tr: Joystick düğmeleri, bir Joystick'e (under-altına) sürüklenmelidir. Düğmeleri eklemeden önce Operatör Arayüzü klasöründe bir kumanda çubuğunuz olmalıdır.
