Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/introduction/robotbuilder-creating-subsystem.po
Languages: es_mx, tr_tr

source: Creating a Subsystem
es_mx: Creando un subsistema
tr_tr: Subsystem-Alt Sistem Oluşturma

source: RobotBuilder has been updated to support the new commandbased framework! Unfortunately, this documentation is outdated and only for the old commandbased framework. Individuals interested in updating this documentation can open a pull request on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository.
es_mx: ¡RobotBuilder se ha actualizado para admitir el nuevo marco basado en comandos! Desafortunadamente, esta documentación está desactualizada y solo para el antiguo marco basado en comandos. Las personas interesadas en actualizar esta documentación pueden abrir una solicitud de extracción en el repositorio `frc-docs <https://github.com/wpilibsuite/frc-docs>` __.
tr_tr: RobotBuilder, yeni komut tabanlı çerçeveyi desteklemek için güncellendi! Ne yazık ki, bu dokümantasyon güncelliğini yitirmiştir ve yalnızca eski komut temelli çerçeve içindir. Bu dokümantasyonu güncellemekle ilgilenen kişiler, `frc-docs <https://github.com/wpilibsuite/frc-docs>`__deposunda bir çekme talebi açabilirler.

source: Subsystems are classes that encapsulate (or contain) all the data and code that make a subsystem on your robot operate. The first step in creating a robot program with the RobotBuilder is to identify and create all the subsystems on the robot. Examples of subsystems are grippers, ball collectors, the drive base, elevators, arms, etc. Each subsystem contains all the sensors and actuators that are used to make it work. For example, an elevator might have a Jaguar speed controller and a potentiometer to provide feedback of the robot position.
es_mx: Los subsistemas son clases que encapsulan (o contienen) todos los datos y códigos que hacen funcionar un subsistema en su robot. El primer paso para crear un programa de robot con el RobotBuilder es identificar y crear todos los subsistemas del robot. Ejemplos de subsistemas son las pinzas, los colectores de pelotas, la base de accionamiento, los elevadores, los brazos, etc. Cada subsistema contiene todos los sensores y actuadores que se utilizan para hacerlo funcionar. Por ejemplo, un ascensor puede tener un controlador de velocidad Jaguar y un potenciómetro para proporcionar información sobre la posición del robot.

source: Creating a Subsystem using the Palette
es_mx: Creación de un subsistema utilizando la paleta
tr_tr: Paleti Kullanarak Alt Sistem Oluşturma

source: Drag the subsystem icon from the palette to the Subsystems folder in the robot description to create a subsystem class.
es_mx: Arrastra el ícono del subsistema de la paleta a la carpeta Subsystems en la descripción del robot para crear una clase de subsistema.
tr_tr: Bir alt sistem sınıfı oluşturmak için alt sistem simgesini paletten robot açıklamasındaki Alt Sistemler klasörüne sürükleyin.

source: Creating a Subsystem using the Context Menu
es_mx: Creación de un subsistema utilizando el menú contextual
tr_tr: Bağlam Menüsünü Kullanarak Alt Sistem Oluşturma

source: Right-click on the Subsystem folder in the robot description to add a subsystem to that folder.
es_mx: Haga clic con el botón derecho del ratón en la carpeta Subsystem de la descripción del robot para añadir un subsistema a esa carpeta.
tr_tr: Bu klasöre bir alt sistem eklemek için robot açıklamasındaki Subsystem-Alt Sistem klasörüne sağ tıklayın.

source: Name the Subsystem
es_mx: Nombrando el subsistema
tr_tr: Subsystem-Alt Sistemi adlandırın

source: After creating the subsystem by either dragging or using the context menu as described above, simply type the name you would like to give the subsystem. The name can be multiple words separated by spaces, RobotBuilder will concatenate the words to make a proper Java or C++ class name for you.
es_mx: Después de crear el subsistema, ya sea arrastrando o usando el menú contextual como se describe arriba, simplemente escriba el nombre que desea darle al subsistema. El nombre puede ser varias palabras separadas por espacios, RobotBuilder concatenará las palabras para hacer un nombre de clase Java o C++ apropiado para usted.
tr_tr: Alt sistemi ya sürükleyerek ya da yukarıda açıklandığı gibi bağlam menüsünü kullanarak oluşturduktan sonra, alt sisteme vermek istediğiniz adı yazmanız yeterlidir. Ad, boşluklarla ayrılmış birden çok kelime olabilir, RobotBuilder sizin için uygun bir Java veya C ++ sınıf adı oluşturmak için kelimeleri birleştirecektir.

source: Adding Constants (2016 Only)
es_mx: Añadiendo constantes (sólo 2016)
tr_tr: Sabitler Ekleme (Yalnızca 2016)

source: Constants are very useful to reduce the amount of magic numbers in your code. In subsystems, they can be used to keep track of certain values, such as sensor values for specific heights of an elevator, or the speed at which to drive the robot.
es_mx: Las constantes son muy útiles para reducir la cantidad de números mágicos en tu código. En los subsistemas, se pueden usar para llevar un registro de ciertos valores, como los valores de los sensores para alturas específicas de un ascensor, o la velocidad a la que se conduce el robot.
tr_tr: Sabitler, kodunuzdaki sihirli sayıların miktarını azaltmak için çok kullanışlıdır. Alt sistemlerde, bir asansörün belirli yükseklikleri için sensör değerleri veya robotun hareket hızı gibi belirli değerleri takip etmek için kullanılabilirler.

source: By default, there will be no constants in a subsystem. Press the button next to "Constants" to open a dialog to create some.
es_mx: Por defecto, no habrá constantes en un subsistema. Presiona el botón junto a "Constantes" para abrir un diálogo para crear algunas.
tr_tr: Varsayılan olarak, bir alt sistemde sabitler olmayacaktır. Bazılarını oluşturmak üzere bir iletişim kutusu açmak için "Constants-Sabitler" in yanındaki düğmeye basın.

source: Creating Constants (2016 Only)
es_mx: Creando constantes (Sólo 2016)
tr_tr: Constants-Sabitler Oluşturma (Yalnızca 2016)

source: The constants table will be empty at first. Press "Add constant" to add one.
es_mx: La mesa de las constantes estará vacía al principio. Presiona "Añadir constante" para añadir una.
tr_tr: Constants-Sabitler tablosu ilk başta boş olacaktır. Sabit eklemek için "Add constant-Sabit ekle" ye basın.

source: Add Constants (2016 Only)
es_mx: Añadir constantes (sólo 2016)
tr_tr: Add Constants-Sabitler Ekle (Yalnızca 2016)

source: The name of the constant. Change this to something descriptive. In this example of a gripper, some good constants might be "open" and "close".
es_mx: El nombre de la constante. Cambie esto por algo descriptivo. En este ejemplo de una pinza, algunas buenas constantes podrían ser "abrir" y "cerrar".
tr_tr: Sabitin adı. Bunu açıklayıcı bir şeye değiştirin. Bu kavrayıcı örneğinde, bazı iyi sabitler "open-açık" ve "close-kapalı" olabilir.

source: The type of the constant. This will most likely be a double, but you can choose from one of: String, double, int, long int, boolean, or byte.
es_mx: El tipo de la constante. Lo más probable es que sea una doble, pero puedes elegir una de ellas: String, doble, int, int larga, booleana o byte.
tr_tr: Sabitin türü. Bu, büyük olasılıkla bir double olacaktır, ancak şunlardan birini seçebilirsiniz: String, double, int, long int, boolean veya byte.

source: The value of the constant.
es_mx: El valor de la constante.
tr_tr: Sabitin değeri.

source: Saving Constants (2016 Only)
es_mx: Guardando constantes (Sólo 2016)
tr_tr: Saving Constants-Sabitleri Kaydetme (Yalnızca 2016)

source: After adding constants and setting their values, just press "Save and close" to save the constants and close the dialog. If you don't want to save, press the exit button on the top of the window.
es_mx: Después de añadir constantes y establecer sus valores, sólo tienes que pulsar "Guardar y cerrar" para guardar las constantes y cerrar el diálogo. Si no quieres guardar, presiona el botón de salida en la parte superior de la ventana.
tr_tr: Sabitleri ekledikten ve değerlerini ayarladıktan sonra, sabitleri kaydetmek ve iletişim kutusunu kapatmak için sadece "Save and close-Kaydet ve kapat" a basın. Kaydetmek istemiyorsanız, pencerenin üst kısmındaki çıkış düğmesine basın.

source: After Saving (2016 Only)
es_mx: Después de Guardar (Sólo 2016)
tr_tr: Kaydettikten Sonra (Yalnızca 2016)

source: After saving constants, the names will appear in the "Constants" button in the subsystem properties.
es_mx: Después de guardar las constantes, los nombres aparecerán en el botón "Constantes" en las propiedades del subsistema.
tr_tr: Sabitleri kaydettikten sonra, isimler alt sistem özelliklerinde "Constants -Sabitler" butonunda görünecektir.

source: Dragging Actuators/Sensors into the Subsystem
es_mx: Arrastrando los actuadores/sensores al subsistema
tr_tr: Aktüatörleri / Sensörleri Alt Sisteme Sürükleme

source: There are two steps to adding components to a subsystem:
es_mx: Hay dos pasos para añadir componentes a un subsistema:
tr_tr: Bir alt sisteme bileşen eklemenin iki adımı vardır:

source: Drag actuators or sensors from the palette into the subsystem as required.
es_mx: Arrastre los actuadores o sensores de la paleta al subsistema según sea necesario.
tr_tr: Aktüatörleri veya sensörleri gerektiği şekilde paletten alt sisteme sürükleyin.

source: Give the actuator or sensor a meaningful name
es_mx: Dale al actuador o al sensor un nombre significativo
tr_tr: Aktüatöre veya sensöre anlamlı bir ad verin

source: Edit the properties such as module numbers and channel numbers for each item in the subsystem.
es_mx: Edita las propiedades como los números de módulo y los números de canal para cada elemento del subsistema.
tr_tr: Alt sistemdeki her öğe için modül numaraları ve kanal numaraları gibi özellikleri düzenleyin.

source: RobotBuilder will automatically use incrementing channel numbers for each module on the robot. If you haven't yet wired the robot you can just let RobotBuilder assign unique channel numbers for each sensor or actuator and wire the robot according to the generating wiring table.
es_mx: RobotBuilder usará automáticamente números de canal crecientes para cada módulo del robot. Si aún no ha cableado el robot, puede dejar que RobotBuilder asigne números de canal únicos para cada sensor o actuador y cablear el robot según la tabla de cableado generado.
tr_tr: RobotBuilder, robot üzerindeki her modül için artan kanal numaralarını otomatik olarak kullanacaktır. Robotu henüz kablolamadıysanız, RobotBuilder'ın her sensör veya aktüatör için benzersiz kanal numaraları atamasına ve robotu üretici kablolama tablosuna göre kablolamasına izin verebilirsiniz.

source: This just creates the subsystem in RobotBuilder, and will subsequently generate skeleton code for the subsystem. To make it actually operate your robot please refer to :ref:`Writing Code for a Subsystem <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-subsystem-code:Writing the Code for a Subsystem>`.
es_mx: Esto sólo crea el subsistema en RobotBuilder, y posteriormente generará el código del esqueleto para el subsistema. Para hacer que funcione realmente su robot, por favor, consulte: ref:`Escribiendo un Código para un Subsistema <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-subsystem-code:Writing the Code for a Subsystem>`.
tr_tr: Bu sadece RobotBuilder'da alt sistemi oluşturur ve daha sonra alt sistem için iskelet kodu oluşturur. Robotunuzu gerçekten çalıştırmasını sağlamak için lütfen bakınız : ref: "Bir Alt Sistem için Kod Yazma <docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-writing-subsystem-code:Writing the Code for a Subsystem>".

source: Subsystems are classes that encapsulate (or contain) all the data and code that make a subsystem on your robot operate. The first step in creating a robot program with the RobotBuilder is to identify and create all the subsystems on the robot. Examples of subsystems are grippers, ball collectors, the drive base, elevators, arms, etc. Each subsystem contains all the sensors and actuators that are used to make it work. For example, an elevator might have a Jaguar Motor Controller and a potentiometer to provide feedback of the robot position.
tr_tr: Subsystem-Alt sistemler, robotunuzdaki bir alt sistemin çalışmasını sağlayan tüm verileri ve kodu kapsayan (veya içeren) sınıflardır. RobotBuilder ile bir robot programı oluşturmanın ilk adımı, robot üzerindeki tüm alt sistemleri tanımlamak ve oluşturmaktır. Alt sistem örnekleri, tutucular, bilyeli toplayıcılar, sürücü tabanı, kaldırıcılar, kollar, vs.'dir. Her bir alt sistem, çalışmasını sağlamak için kullanılan tüm sensörleri ve aktüatörleri içerir. Örneğin, bir asansörde, robot pozisyonunun geri bildirimini sağlamak için bir Jaguar Motor Kontrol Cihazı ve bir potansiyometre olabilir.
