Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/introduction/robotbuilder-created-code.po
Languages: es_mx, fr_ca, tr_tr

source: RobotBuilder Created Code
es_mx: Código Creado con RobotBuilder
fr_ca: Code créé par RobotBuilder
tr_tr: RobotBuilder tarafından Oluşturulan Kod

source: RobotBuilder has been updated to support the new commandbased framework! Unfortunately, this documentation is outdated and only for the old commandbased framework. Individuals interested in updating this documentation can open a pull request on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository.
fr_ca: RobotBuilder a été mis à jour pour prendre en charge le nouveau cadre de développement orienté commande! Malheureusement, cette documentation est obsolète et n'est valable que pour l’ancien cadre de développement orienté commande. Les personnes intéressées à mettre à jour la nouvelle documentation peuvent ouvrir un pull request sur le dépôt `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ .
tr_tr: RobotBuilder, yeni komut tabanlı çerçeveyi desteklemek için güncellendi! Ne yazık ki, bu dokümantasyon güncelliğini yitirmiştir ve yalnızca eski komut tabanlı çerçeve içindir. Bu dokümantasyonu güncellemekle ilgilenen kişiler, `frc-docs <https://github.com/wpilibsuite/frc-docs>` __ havuzuna destekte bulunabilirler.

source: The Layout of a RobotBuilder Generated Project
es_mx: El Diseño de un Proyecto Generado de RobotBuilder.
fr_ca: La disposition d'un projet généré par RobotBuilder
tr_tr: RobotBuilder Tarafından Oluşturulan Bir Projenin Düzeni

source: A RobotBuilder generated project consists of a package (in Java) or a folder (in C++) for Commands and another for Subsystems. Each command or subsystem object is stored under those containers. At the top level of the project you'll find the robot main program (Robot.java), the Operator Interface file (OI.java) and the RobotMap that contains the code to create all the subsystem components that were added to the robot description.
es_mx: Un proyecto generado de RobotBuilder consiste en una paquete (en Java) o una carpeta (en C++) para comandos y otro para Subsistemas. Cada objeto de comando o subsistema se almacena en aquellos contenedores. En el nivel superior del proyecto encontrarás el programa principal del robot (Robot.java), el archivo de la Interfaz del Operador (OI.java) y el RobotMap que contiene el código para crear todos los componentes del subsistema que se añadieron a la descripción del robot.
fr_ca: Un projet généré par RobotBuilder se compose d'un package (en Java) ou d'un dossier (en C ++) pour les commandes et un autre pour les sous-systèmes. Chaque objet de commande ou de sous-système est stocké sous ces conteneurs. Au niveau supérieur du projet, vous trouverez le programme principal du robot (Robot.java), le fichier d'interface opérateur (OI.java) et le RobotMap qui contient le code pour créer tous les composants du sous-système qui ont été ajoutés à la description du robot .
tr_tr: RobotBuilder tarafından oluşturulan bir proje, bir paket (Java'da) veya Komutlar için bir klasör (C ++ 'da) ve Alt Sistemler için bir diğerinden oluşur. Her komut veya alt sistem nesnesi bu kaplar altında saklanır. Projenin en üst seviyesinde, robot ana programını (Robot.java), Operatör Arayüz dosyasını (OI.java) ve robot açıklamasına eklenen tüm alt sistem bileşenlerini oluşturmak için kodu içeren RobotMap'i bulacaksınız. .

source: Autogenerated Code
es_mx: Código Autogenerado
fr_ca: Code généré automatiquement
tr_tr: Otomatik Oluşturulan Kod

source: When the robot description is modified and code is re-exported RobotBuilder is designed to not modify any changes you made to the file, thus preserving your code. This makes RobotBuilder a full-lifecycle tool. To know what code is OK to be modified by RobotBuilder, it generates sections that will potentially have to be rewritten delimited with some special comments. These comments are shown in the example above. Don't add any code within these comment blocks, it will be rewritten next time the project is exported from RobotBuilder.
es_mx: Cuando la descripción del robot es modificada y el código es re-exportado, RobotBuilder está diseñado para no modificar ningún cambio que haya hecho en el archivo, preservando así tu código. Esto hace de RobotBuilder una herramienta de ciclo de vida completo. Para saber qué código está bien para ser modificado por RobotBuilder, genera secciones que potencialmente tendrán que ser reescritas delimitadas con algunos comentarios especiales. Estos comentarios se muestran en el ejemplo anterior. No añada ningún código dentro de estos bloques de comentarios, se reescribirá la próxima vez que el proyecto se exporte desde RobotBuilder.
fr_ca: Lorsque la description du robot est modifiée et que le code est réexporté, RobotBuilder est conçu pour ne pas modifier les modifications que vous avez apportées au fichier, préservant ainsi votre code. Cela fait de RobotBuilder un outil de cycle de vie complet. RobotBuilder indique les sections qui devront potentiellement être réécrites en les délimitant avec quelques commentaires spéciaux. Ces commentaires sont illustrés dans l'exemple ci-dessus. N'ajoutez aucun code dans ces blocs de commentaires, il sera réécrit la prochaine fois que le projet sera exporté de RobotBuilder.
tr_tr: Robot açıklaması değiştirildiğinde ve kod yeniden dışa aktarıldığında, RobotBuilder dosyada yaptığınız değişiklikleri koruyacak ve böylece kodunuzu koruyacak şekilde tasarlanmıştır. Bu, RobotBuilder'ı tam bir yaşam döngüsü aracı yapar. RobotBuilder hangi kodun değiştirilmesinin uygun olduğunu bilmek için, bazı özel yorumlarla sınırlandırılarak potansiyel olarak yeniden yazılması gereken bölümler oluşturur. Bu yorumlar yukarıdaki örnekte gösterilmektedir. Bu yorum bloklarına herhangi bir kod eklemeyin, projenin RobotBuilder'dan bir sonraki dışa aktarılışında yeniden yazılacaktır.

source: If code inside one of these blocks must be modified, the comments can be removed, but this will prevent further updates from happening later. In the above example, if the //BEGIN and //END comments were removed, then later another required subsystem was added in RobotBuilder, it would not be generated on that next export.
es_mx: Si el código dentro de uno de estos bloques debe ser modificado, los comentarios pueden ser eliminados, pero esto evitará que se produzcan más actualizaciones más adelante. En el ejemplo anterior, si los comentarios //BEGIN y //END fueran removidos, y más tarde se añadió otro subsistema necesario en RobotBuilder, no se generaría en esa próxima exportación.
fr_ca: Si le code à l'intérieur d'un de ces blocs doit être modifié, les commentaires peuvent être supprimés, mais cela empêchera d'autres mises à jour de se produire plus tard. Dans l'exemple ci-dessus, si les commentaires // BEGIN et // END étaient supprimés, puis un autre sous-système requis était ajouté dans RobotBuilder, il ne serait pas généré lors du prochain Export.
tr_tr: Bu bloklardan birinin içindeki kodun değiştirilmesi gerekiyorsa, yorumlar kaldırılabilir, ancak bu daha sonra başka güncellemelerin yapılmasını önleyecektir. Yukarıdaki örnekte, //BEGIN ve //END açıklamaları kaldırıldıysa, daha sonra RobotBuilder'a başka bir gerekli alt sistem eklendi, sonraki dışa aktarmada oluşturulmayacaktı.

source: Main Robot Program
es_mx: Programa Principal del Robot
fr_ca: Programme de robot principal
tr_tr: Ana Robot Programı

source: This is the main program generated by RobotBuilder. There are a number of parts to this program (highlighted sections):
es_mx: Este es el programa principal generado por RobotBuilder. Hay un número de partes en este programa (secciones resaltadas):
fr_ca: Il s'agit du programme principal généré par RobotBuilder. Ce programme comprend plusieurs parties (sections mises en évidence):
tr_tr: Bu, RobotBuilder tarafından oluşturulan ana programdır. Bu programın birkaç bölümü vardır (vurgulanan bölümler):

source: This class extends TimedRobot. TimedRobot will call your ``autonomousPeriodic()`` and ``teleopPeriodic()`` methods every 20ms.
es_mx: Esta clase extiende TimedRobot. TimedRobot llamará a los métodos ``autonomousPeriodic()`` y ``teleopPeriodic()`` cada 20 ms.
fr_ca: Cette classe étend TimedRobot. TimedRobot appellera toutes les 20 mSec vos méthodes ``autonomousPeriodic()`` et ``teleopPeriodic()``.
tr_tr: Bu sınıf TimedRobot'u geliştirir. TimedRobot her 20 ms'de bir ``autonomousPeriodic()`` ve ``teleopPeriodic()`` yöntemlerinizi çağıracaktır.

source: Each of the subsystems is declared here. These are public static variables so that they can be referenced from throughout your robot program by writing Robot.<subsystem-name>.method(), for example ``Robot.elevator.setSetpoint(4)``.
es_mx: Cada uno de los subsistemas se declara aquí. Estas son variables estáticas públicas para que puedan ser referenciadas a través de todo su programa del robot, escribiendo Robot.<subsystem-name>.method(), por ejemplo ``Robot.elevator.setSetpoint(4)``.
fr_ca: Chacun des sous-systèmes est déclaré ici. Ce sont des variables statiques publiques qui peuvent être référencées dans tout votre programme de robot en écrivant Robot.<subsystem-name>.method (), par exemple ``Robot.elevator.setSetpoint(4)``.
tr_tr: Alt sistemlerin her biri burada açıklanmıştır. Bunlar genel statik değişkenlerdir, böylece robot programınız boyunca Robot yazarak başvurulabilirler. <subsystem-name> .method (), örneğin `` Robot.elevator.setSetpoint (4) ".

source: The subsystems are instantiated in the robotInit() method that is called after the constructor runs for this class. It is important to be create the subsystems after the constructor to avoid recursive loops. Also instance of the ``OI()`` class (for your operator interface) and the autonomous command are created here.
es_mx: Los subsistemas se instancian en el método robotInit() que se llama después de que el constructor corre para esta clase. Es importante crear los subsistemas después del constructor para evitar bucles recursivos. También la instancia de la clase ``OI()`` (para su interfaz del operador) y el comando autónomo se crean aquí.
fr_ca: Les sous-systèmes sont instanciés dans la méthode ``robotInit()`` qui est appelée après l'exécution du constructeur pour cette classe. Il est important de créer les sous-systèmes après le constructeur pour éviter les boucles récursives. Des instances de la classe ``OI()`` (pour votre interface opérateur) et la commande autonome sont également créées ici.
tr_tr: Alt sistemler, yapıcı bu sınıf için çalıştıktan sonra çağrılan robotInit() yönteminde somutlaştırılır. Yinelemeli döngülerden kaçınmak için yapıcıdan sonra alt sistemler oluşturmak önemlidir. Ayrıca ``OI()`` sınıfının örneği (operatör arayüzünüz için) ve otonom komut burada oluşturulur.

source: In the ``autonomousInit()`` method which is called every ``20ms``, make one scheduling pass. That will call the ``isFinished()`` and ``execute()`` methods of every command that is currently scheduled.
es_mx: En el método ``autonomousInit()`` que se llama cada ``20ms``, haz un pase de programación. Eso llamará a los métodos ``isFinished()`` y ``execute()`` de cada comando que está actualmente programado.
fr_ca: Dans la méthode ``autonomousInit()`` qui est appelée tous les ``20 mSec``, faire une passe de planification. Cela appellera les méthodes ``isFinished()`` et ``execute()`` de chaque commande actuellement planifiée.
tr_tr: Her ``20ms``olarak adlandırılan `` autonomousInit ()`` yönteminde, bir zamanlama geçişi yapın. Bu, şu anda zamanlanmış olan her komutun ``isFinished ()`` ve ``execute()`` yöntemlerini çağıracaktır.

source: If there is an autonomous command provided in RobotBuilder robot properties, it is scheduled at the start of autonomous in the ``autonomousInit()`` method and canceled at the end of the autonomous period in ``teleopInit()``.
es_mx: Si hay un comando autónomo provisto en las propiedades del robot en RobotBuilder, es programado al inicio de la autonomía en el método ``autonomousInit()`` y cancelado al final del período autónomo en ``teleopInit()``.
fr_ca: S'il existe une commande autonome fournie dans les propriétés du robot RobotBuilder, elle est planifiée au début du mode autonome dans la méthode ``autonomousInit()`` et annulée à la fin de la période autonome dans ``teleopInit()``.
tr_tr: RobotBuilder robot özelliklerinde sağlanan otonom bir komut varsa, ``otonomousInit ()``yönteminde otonom başlangıcında planlanır ve `` teleopInit ()`` içindeki otonom dönemin sonunda iptal edilir.

source: In the teleopPeriodic method which is called every 20ms, make one scheduling pass.
es_mx: En el método teleopPeriodic que se llama cada 20ms, haga un pase de programación.
fr_ca: Dans la méthode teleopPeriodic qui est appelée toutes les 20 ms, effectuez une seule passe de planification.
tr_tr: Her 20 ms'de bir çağrılan teleopPeriodic yönteminde, bir planlama geçişi yapın.

source: RobotMap - Generation of Actuator and Sensor Objects
es_mx: RobotMap - Generación de Objetos Actuadores y Sensores
fr_ca: RobotMap - Génération d'objets actionneurs et capteurs
tr_tr: RobotMap - Aktüatör ve Sensör Nesnelerinin Üretimi

source: The RobotMap is a mapping from the ports sensors and actuators are wired into to a variable name. This provides flexibility changing wiring, makes checking the wiring easier and significantly reduces the number of magic numbers floating around. All the definitions of sensors and motors from the robot description are generated here.
es_mx: El RobotMap es un mapa de los puertos en los que los sensores y actuadores están conectados a una variable. Esto proporciona flexibilidad para cambiar el cableado, facilita la comprobación del mismo y reduce significativamente el número de números mágicos que flotan alrededor. Todas las definiciones de los sensores y motores de la descripción del robot se generan aquí.
fr_ca: Le RobotMap est un mappage entre les ports physiques où les capteurs et les dispositifs actionneurs sont branchés et un nom de variable. Cela permet une certaine flexibilité au niveau du câblage, facilite la vérification du câblage, et prévient les appels directs aux ports physiques. Toutes les définitions des capteurs et moteurs de la description du robot sont générées ici.
tr_tr: RobotMap, port sensörlerinden bir eşlemedir ve aktüatörler, değişken bir ada bağlanmıştır. Bu esneklik değiştiren kablolar sağlar, kabloları kontrol etmeyi kolaylaştırır ve etrafta dolaşan sihirli sayıların sayısını önemli ölçüde azaltır. Robot açıklamasından tüm sensör ve motor tanımları burada oluşturulur.

source: Notice that each sensor and actuator is added to the LiveWindow class (3) so that the can be automatically displayed when the SmartDashboard is set to LiveWindow mode. Also any properties for the particular sensor or actuator is set here to reflect the settings made in the robot description. (1)
es_mx: Note que cada sensor y actuador se añade a la clase LiveWindow (3) para que se muestren automáticamente cuando el SmartDashboard esté configurado en modo LiveWindow. También cualquier propiedad de un sensor o actuador en particular se establece aquí para reflejar los ajustes realizados en la descripción del robot. (1)
fr_ca: Notez que chaque capteur et dispositif actionneur est ajouté à la classe LiveWindow (3) afin qu'ils puissent être affichés automatiquement lorsque le SmartDashboard est réglé sur le mode LiveWindow. Toutes les propriétés du capteur ou de l'actionneur particulier sont également définies ici pour refléter les paramètres définis dans la description du robot. (1)
tr_tr: SmartDashboard LiveWindow moduna ayarlandığında otomatik olarak görüntülenebilmesi için her bir sensör ve aktüatörün LiveWindow sınıfına (3) eklendiğine dikkat edin. Ayrıca, belirli sensör veya aktüatör için herhangi bir özellik, robot açıklamasında yapılan ayarları yansıtacak şekilde burada ayarlanır. (1)

source: Each of the references for the objects are declared and instantiated here (2, 3), but they are copied into every subsystem to make it easy and clean to write code that uses them.
es_mx: Cada una de las referencias de los objetos son declaradas e instanciadas aquí (2,3) pero son copiadas en cada subsistema para facilitar y limpiar la escritura del código que los utiliza.
fr_ca: Chacune des références pour les objets est déclarée et instanciée ici (2, 3), mais elles sont copiées dans chaque sous-système pour faciliter et clarifier l'écriture de code qui vont les utiliser.
tr_tr: Nesnelerin referanslarının her biri burada (2, 3) bildirilir ve örneklenir, ancak bunları kullanan kod yazmayı kolay ve temiz hale getirmek için her alt sisteme kopyalanırlar.

source: OI Class - The Operator Interface
es_mx: Clase OI - La Interfaz del Operador.
fr_ca: Classe OI - L'interface opérateur
tr_tr: OI Sınıfı - Operatör Arayüzü

source: The code for all the operator interface components is generated here (1). In addition the code to link the OI buttons to commands that should run is also generated here (2).
es_mx: El código de todos los componentes de la interfaz del operador se genera aquí (1). Además, el código para vincular los botones de OI a los comandos que deben ejecutarse también se generan aquí (2).
fr_ca: Le code de tous les composants de l'interface opérateur est généré ici (1). De plus, le code pour lier les boutons OI aux commandes à exécuter est également généré ici (2).
tr_tr: Tüm operatör arayüz bileşenlerinin kodu burada oluşturulur (1). Ek olarak, OI düğmelerini çalıştırması gereken komutlara bağlayan kod da burada oluşturulur (2).
