Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/introduction/robotbuilder-interface.po
Languages: es_mx

source: RobotBuilder User Interface
es_mx: Interfaz de Usuario de RobotBuilder

source: RobotBuilder has been updated to support the new commandbased framework! Unfortunately, this documentation is outdated and only for the old commandbased framework. Individuals interested in updating this documentation can open a pull request on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository.
es_mx: ¡RobotBuilder se ha actualizado para admitir el nuevo marco basado en comandos! Desafortunadamente, esta documentación está desactualizada y solo para el antiguo marco basado en comandos. Las personas interesadas en actualizar esta documentación pueden abrir una solicitud de extracción en el repositorio `frc-docs <https://github.com/wpilibsuite/frc-docs>`__.

source: RobotBuilder has a user interface designed for rapid development of robot programs. Almost all operations are performed by drag-and-drop or selecting options from drop-down lists.
es_mx: RobotBuilder tiene una interfaz de usuario diseñada para el desarrollo rápido de programas de robots. Casi todas las operaciones se realizan mediante arrastrar y soltar o seleccionando opciones de las listas desplegables.

source: Dragging Items from the Palette to the Robot Description
es_mx: Arrastrando elementos de la Paleta a la Descripción del Robot

source: You can drag items from the palette to the robot description by starting the drag on the palette item and ending on the container where you would like the item to be located. In this example, dropping a potentiometer to the Elevator subsystem.
es_mx: Puedes arrastrar los elementos de la paleta a la descripción del robot empezando el arrastre en el elemento de la paleta y terminando en el contenedor donde quieres que se ubique el elemento. En este ejemplo, dejando caer un potenciómetro al subsistema del Elevador.

source: Adding Components using the Right-Click Context Menu
es_mx: Agregar Componentes usando el clic derecho del Menú Contextual

source: A shortcut method of adding items to the robot description is to right-click on the container object (Elevator) and select the item that should be added (Potentiometer). This is identical to using drag and drop but might be easier for some people.
es_mx: Un método abreviado para añadir elementos a la descripción del robot es hacer clic con el botón derecho del ratón en el objeto contenedor (Elevador) y seleccionar el elemento que debe añadirse (Potenciómetro). Esto es idéntico al uso de arrastrar y soltar, pero podría ser más fácil para algunas personas.

source: Editing Properties of Robot Description Items
es_mx: Edición de las Propiedades de los Elementos de Descripción de los Robots

source: The properties for a selected item will appear in the properties viewer. The properties can be edited by selecting the value in the right hand column.
es_mx: Las propiedades de un elemento seleccionado aparecerán en el visor de propiedades. Las propiedades se pueden editar seleccionando el valor en la columna de la derecha.

source: Using the Menu System
es_mx: Usando el Sistema de Menús

source: Operations for RobotBuilder can either be selected through the menu system or the equivalent item (if it is available) from the toolbar.
es_mx: Las operaciones de RobotBuilder pueden seleccionarse ya sea a través del sistema de menús o el elemento equivalente (si está disponible) de la barra de herramientas.
