Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/3rd-party-libraries.po
Languages: es_mx, he_il

source: 3rd Party Libraries
es_mx: Bibliotecas de 3ros
he_il: ספריות צד שלישי

source: A number of software components were broken out of WPILib starting in 2017 and are now maintained by the third parties who produce the hardware. See `this <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ blog for more details.
es_mx: Varios componentes de software se separaron de WPILib a partir de 2017 y ahora son mantenidos por terceros que producen el hardware. Consulte `este blog <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>` __ para obtener más detalles.
he_il: מספר רכיבי תוכנה התנתקו מ-WPILib החל מעונת 2017 וכעת הם מתוחזקים על ידי הצדדים השלישי המייצרים את החומרה. ראו את `הבלוג הזה <https://www.firstinspires.org/robotics/frc/blog/2017-control-system-update>`__ עבור מידע נוסף.

source: Libraries
es_mx: Bibliotecas
he_il: ספריות

source: These are **not** links to directly plug in to the VS Code -> Install New Libraries (online) feature. Click these links to visit the vendor site to see whether they offer online installers, offline installers, or both.
es_mx: Estos **no** son enlaces para conectarse directamente a la función VS Code -> Instalar nuevas bibliotecas (en línea). Haga clic en estos enlaces para visitar el sitio del proveedor y ver si ofrecen instaladores en línea, instaladores fuera de línea o ambos.

source: `Analog Devices ADIS16448 IMU <https://github.com/juchong/ADIS16448-roboRIO-Driver>`__ - Driver for ADIS16448 IMU. More info `here <https://wiki.analog.com/first/first_robotics_donation_resources#adis16448_imu_board_for_first_robotics>`__
es_mx: `Analog Devices ADIS16448 IMU <https://github.com/juchong/ADIS16448-roboRIO-Driver>`__ - Driver para ADIS16448 IMU. Más información `aquí <https://wiki.analog.com/first/first_robotics_donation_resources#adis16448_imu_board_for_first_robotics>`__

source: `Analog Devices ADIS16470 IMU <https://github.com/juchong/ADIS16470-roboRIO-Driver>`__ - Driver for ADIS16470 IMU. More info `here <https://wiki.analog.com/first/first_robotics_donation_resources#adis16470_imu_board_for_first_robotics>`__
es_mx: Analog Devices ADIS16470 IMU <https://github.com/juchong/ADIS16470-roboRIO-Driver>`__ - Driver para ADIS16470 IMU. Más información `aquí <https://wiki.analog.com/first/first_robotics_donation_resources#adis16470_imu_board_for_first_robotics>`__

source: `Copperforge LibCu Software Library <https://copperforge.cc/docs/software/libcu/>`__ - Library for all Copperforge devices including the Lasershark
es_mx: `Copperforge LibCu Software Library <https://copperforge.cc/docs/software/libcu/>`__ - Biblioteca para todos los dispositivos Copperforge incluyendo el Lasershark

source: `CTRE Phoenix Toolsuite <https://www.ctr-electronics.com/control-system/hro.html#product_tabs_technical_resources>`__ - Contains CANCoder, Canifier, Pigeon, Talon FX, Talon SRX, and Victor SPX Libraries and Phoenix Tuner program for configuring CTRE CAN devices
es_mx: CTRE Phoenix Toolsuite <https://www.ctr-electronics.com/control-system/hro.html#product_tabs_technical_resources>`__ - Contiene bibliotecas de CANCoder, Canifier, Pigeon, Talon FX, Talon SRX, y Victor SPX y el programa Phoenix Tuner para configurar dispositivos CTRE CAN

source: `Digilent <https://reference.digilentinc.com/dmc-60c/getting-started>`__ - DMC-60C library
es_mx: Digilent <https://reference.digilentinc.com/dmc-60c/getting-started>`__ - Biblioteca de DMC-60C

source: `Playing With Fusion Driver <https://www.playingwithfusion.com/docview.php?docid=1205>`__ - Library for all PWF devices including the Venom motor/controller
es_mx: `Playing With Fusion Driver <https://www.playingwithfusion.com/docview.php?docid=1205>` __ - Biblioteca para todos los dispositivos PWF, incluido el motor / controlador Venom

source: `Kauai Labs <https://pdocs.kauailabs.com/navx-mxp/software/roborio-libraries/>`__ - Libraries for NavX-MXP, NavX-Micro, and Sensor Fusion
es_mx: `Kauai Labs <https://pdocs.kauailabs.com/navx-mxp/software/roborio-libraries/>`__ - Bibliotecas para NavX-MXP, NavX-Micro, y Sensor Fusion

source: `Rev Robotics Color Sensor V3 <http://www.revrobotics.com/rev-31-1557/>`__ - Library for Rev Robotics Color Sensor included in 2020 Kit of Parts
es_mx: `Rev Robotics Color Sensor V3 <http://www.revrobotics.com/rev-31-1557/>` __ - Biblioteca para Rev Robotics Color Sensor incluido en el kit de piezas 2020

source: `Rev Robotics SPARK MAX <https://www.revrobotics.com/sparkmax-software/>`__ - SPARK MAX Library
es_mx: `Rev Robotics SPARK MAX <https://www.revrobotics.com/sparkmax-software/>`__ - Biblioteca SPARK MAX

source: Community Libraries
es_mx: Bibliotecas comunitarias
he_il: ספריות מהקהילה

source: `PhotonVision <https://docs.photonvision.org/en/latest/docs/programming/photonlib/adding-vendordep.html>`_ - Library for PhotonVision CV software
es_mx: `PhotonVision <https://docs.photonvision.org/en/latest/docs/programming/photonlib/adding-vendordep.html>`_ - Biblioteca para el software PhotonVision CV

source: WPILib Command Libraries
es_mx: Bibliotecas de comandos de WPILib

source: The WPILib :doc:`old </docs/software/old-commandbased/index>` and :doc:`new </docs/software/commandbased/index>` command libraries have been split into vendor libraries in order to reduce the chances of mixing the two which will not work correctly. They are both installed by the wpilib installer for offline installation. They may also be installed with the following online links:
es_mx: Las bibliotecas de comandos WPILib :doc:`old </docs/software/old-commandbased/index>` y :doc:`new </docs/software/commandbased/index>` se han dividido en bibliotecas de proveedores para reducir las posibilidades de mezclar las dos que no funcionarán correctamente. Ambos son instalados por el instalador de wpilib para la instalación fuera de línea. También se pueden instalar con los siguientes enlaces en línea:

source: `Old Command Library <https://raw.githubusercontent.com/wpilibsuite/allwpilib/master/wpilibOldCommands/WPILibOldCommands.json>`__
es_mx: `Biblioteca de comandos antigua <https://raw.githubusercontent.com/wpilibsuite/allwpilib/master/wpilibOldCommands/WPILibOldCommands.json>` __

source: `New Command Library <https://raw.githubusercontent.com/wpilibsuite/allwpilib/master/wpilibNewCommands/WPILibNewCommands.json>`__
es_mx: `Nueva biblioteca de comandos <https://raw.githubusercontent.com/wpilibsuite/allwpilib/master/wpilibNewCommands/WPILibNewCommands.json>`__

source: The Mechanism
es_mx: El mecanismo

source: In support of this effort NI (for LabVIEW) and FIRST/WPI (for C++/Java) have developed mechanisms that should make it easy for vendors to plug their code into the WPILib software and for teams to use that code once it has been installed. A brief description of how the system works for each language can be found below.
es_mx: En apoyo a este esfuerzo NI (para LabVIEW) y FIRST/WPI (para C++/Java) han desarrollado mecanismos que deberían facilitar a los proveedores a conectar su código a el software de WPILib y para que equipos que programan una vez que ya ha sido instalado. Una breve descripción de como el sistema funciona para cada lenguaje de programación se puede encontrar abajo.

source: The Mechanism - LabVIEW
es_mx: El mecanismo-LabVIEW

source: For LabVIEW teams, you may notice a few new Third Party items on various palettes (specifically, one in Actuators, one in Actuators->Motor Control labeled “CAN Motor”, and one in “Sensors”). These correspond to folders in ``C:\Program Files\National Instruments\LabVIEW 2016\vi.lib\Rock Robotics\WPI\Third Party``.
es_mx: Para equipos que utilizan LabVIEW, puede notar unos artículos nuevos de bibliotecas de terceros en varias paletas (específicamente en Actuators, uno en Actuators->Motor Control labeled “CAN Motor”, y otro en "Sensors"). Estos corresponden a las carpetas ``C:\Program Files\National Instruments\LabVIEW 2016\vi.lib\Rock Robotics\WPI\Third Party``.
he_il: עבור קבוצות LabVIEW, ייתכן ותבחינו בכמה פריטים חדשים של צד שלישי בפלטות שונות (במיוחד ב-Actuators, אחד ב-Actuators->Motor Control הנקרא "CAN Motor" ואחד ב-"Sensors"). אלה תואמים לתיקיות ב-``C:\Program Files\National Instruments\LabVIEW 2016\vi.lib\Rock Robotics\WPI\Third Party``.

source: For a library to insert VI’s in these palettes, they simply make a subfolder in one of these three Third Party folders containing their VIs and they will be added automatically. To control the appearance of the palette (have some VI’s not show up, set the Icon for the folder, etc.) there is a process to create a dir.mnu file for your directory. We will be working on documenting that process shortly.
es_mx: Para que una biblioteca inserte VI en estas paletas, simplemente crea una subcarpeta en una de estas tres carpetas de terceros que contiene sus VI y se agregarán automáticamente. Para controlar la apariencia de la paleta (hacer que algunos VI no aparezcan, configurar el icono de la carpeta, etc.) hay un proceso para crear un archivo dir.mnu para su directorio. En breve estaremos trabajando para documentar este proceso.

source: To use installed Third Party libraries, simply locate the VIs in one of these 3 locations and drag them into your project as you would with any other VI.
es_mx: Para usar bibliotecas de terceros ya instaladas, simplemente ubique los VI en una de estas 3 ubicaciones y arrástrelos a su proyecto como lo haría con cualquier otro VI.

source: The Mechanism - C++/Java
es_mx: El mecanismo - C++/Java

source: For C++ and Java a JSON file describing the vendor library is installed on your system to ``~/wpilib/YYYY/vendordeps`` (where YYYY is the year and ~ is ``C:\Users\Public`` on Windows). This can either be done by an offline installer or the file can be fetched from an online location using the menu item in Visual Studio Code. This file is then used from VS Code to add to the library to each individual project. Vendor library information is managed on a per-project basis to make sure that a project is always pointing to a consistent version of a given vendor library. The libraries themselves are placed in the Maven cache at ``C:\Users\Public\wpilib\YYYY\maven``. Vendors can place a local copy here with an offline installer (recommended) or require users to be online for an initial build to fetch the library from a remote Maven location.
es_mx: Para C ++ y Java, un archivo JSON que describe la biblioteca del proveedor está instalado en su sistema en ``~/wpilib/ YYYY/vendordeps`` (donde YYYY es el año y ~ es ``C:\Users\Public`` en Windows) . Esto se puede realizar mediante un instalador sin conexión o el archivo se puede recuperar desde una ubicación en línea utilizando el elemento de menú en Visual Studio Code. Luego, este archivo se usa desde VS Code para agregarlo a la biblioteca de cada proyecto individual. La información de la biblioteca del proveedor se administra por proyecto para asegurarse de que un proyecto siempre apunta a una versión coherente de una biblioteca de proveedor determinada. Las bibliotecas en sí se colocan en la caché de Maven en ``C:\Users\Public\wpilib\YYYY\maven``. Los proveedores pueden colocar una copia local aquí con un instalador fuera de línea (recomendado) o requerir que los usuarios estén en línea para una compilación inicial para obtener la biblioteca desde una ubicación remota de Maven.

source: The JSON file allows specification of complex libraries with multiple components (C++, Java, JNI, etc.) and also helps handle some complexities related to simulation. Vendors choosing to provide a remote URL in the JSON also enable users to check for updates from within VS Code.
es_mx: El archivo JSON permite la especificación de bibliotecas complejas con diversos componentes(C++, Java, JNI, etc.) y también ayuda a manejar algunas dificultades relacionadas a simulaciones. Los proveedores al elegir proveer una URL remota en JSON también permiten que los usuarios buscar actualizaciones dentro de VS Code.

source: The vendor JSON files are actually processed by GradleRIO once they are in your projects vendordeps folder. If you are using another IDE, you will need to manually create a “vendordeps” folder in your project and copy any desired vendor JSON files from the “wpilib/YYYY” folder (where they should be placed by an offline installer) or download them directly from the vendor and place them into the folder in the project.
es_mx: GradleRIO procesa los archivos JSON del proveedor una vez que están en la carpeta vendordeps de su proyecto. Si está utilizando otro IDE, deberá crear manualmente una carpeta "vendordeps" en su proyecto y copiar los archivos JSON del proveedor que desee de la carpeta "wpilib / YYYY" (donde debe colocarlos un instalador sin conexión) o descargarlos directamente del proveedor y colóquelos en la carpeta del proyecto.

source: Adding an Offline-Installed Library
es_mx: Agregar un biblioteca Offline-Instalada
he_il: הוספת ספרייה המותקנת במצב לא מקוון

source: To add a vendor library that has been installed by an offline installer, press :kbd:`Ctrl+Shift+P` and type WPILib or click on the WPILib icon in the top right to open the WPILib Command Palette and begin typing **Manage Vendor Libraries**, then select it from the menu. Select the option to **Install new libraries (offline)**.
es_mx: Para añadir una librería vendor que se ha instalado por uno fuera de línea, presione :kbd:`Ctrl+Shift+P` y escriba WPILib o de click en el icono de WPILib en la esquina superior derecha para abrir la Paleta de Comandos de WPILib y empiece a escribir **Manage Vendor Libraries**, después selecciónelo en el menú. Seleccione la opción de **Install new libraries (offline)**.

source: Select the desired libraries to add to the project by checking the box next to each, then click OK. The JSON file will be copied to the **vendordeps** folder in the project, adding the library as a dependency to the project.
es_mx: Seleccione las bibliotecas que desee agregar al proyecto al marcar la casilla junto a cada una, después de clic en OK. El archivo JSON será copiado a la carpeta **vendordeps** en el proyecto, agregando la biblioteca como una dependencia al proyecto.

source: Checking for Updates (Offline)
es_mx: Buscando actualizaciones (sin conexión)
he_il: חיפוש עדכונים (Offline)

source: Remember: Dependencies are now version managed and done on a per-project bases. Even if you have installed an updated library using an offline installer, you will need to Manage Vendor Libraries and select **Check for updates (offline)** for each project you wish to update.
es_mx: Recuerde: las dependencias ahora se administran por versión y se realizan por proyecto. Incluso si ha instalado una biblioteca actualizada con un instalador fuera de línea, deberá administrar las bibliotecas de proveedores y seleccionar **Check for updates (offline)** para cada proyecto que desee actualizar.

source: Checking for Updates (Online)
es_mx: Comprobación de actualizaciones (en línea)
he_il: חיפוש עדכונים (Online)

source: Part of the JSON file that vendors may optionally populate is an online update location. If a library has an appropriate location specified, running **Check for updates (online)** will check if a newer version of the library is available from the remote location.
es_mx: Parte del archivo JSON que los proveedores pueden completar opcionalmente es una ubicación de actualización en línea. Si una biblioteca tiene una ubicación adecuada especificada, ejecutar **Check for updates (online)** comprobará si hay una versión más nueva de la biblioteca disponible desde la ubicación remota.

source: Removing a Library Dependency
es_mx: Eliminar una dependencia de biblioteca
he_il: הסרת תלות בספריה

source: To remove a library dependency from a project, select **Manage Current Libraries** from the **Manage Vendor Libraries** menu, check the box for any libraries to uninstall and click OK. These libraries will be removed as dependencies from the project.
es_mx: Para eliminar una dependencia de biblioteca de un proyecto, seleccione **Manage Current Libraries** en el menú **Manage Vendor Libraries**, marque la casilla de las bibliotecas que desee desinstalar y haga clic en Aceptar. Estas bibliotecas se eliminarán como dependencias del proyecto.
he_il: כדי להסיר תלות בספריה מפרויקט, בחר **Manage Current Libraries** מתפריט ה-**Manage Vendor Libraries**, סמן את התיבה עבור ספריות להסרת התקנה ולחץ על אישור. ספריות אלו יוסרו כתלות מהפרויקט.

source: Command-Line Interface (Online)
es_mx: Interfaz de línea de comandos (en línea)

source: Adding a vendor library dependency from the vendor URL can also be done through the command-line via a gradle task. Open a command-line instance at the project root, and enter ``gradlew vendordep --url=<url>`` where ``<url>`` is the vendor JSON URL. This will add the vendor library dependency JSON file to the ``vendordeps`` folder of the project. Vendor libraries can be updated the same way.
es_mx: También se puede agregar una dependencia de biblioteca de proveedor desde la URL del proveedor a través de la línea de comandos a través de una tarea gradle. Abra una instancia de la línea de comandos en la raíz del proyecto e ingrese ``gradlew vendordep--url=<url>`` donde``<url>`` es la URL JSON del proveedor. Esto agregará el archivo JSON de dependencia de la biblioteca del proveedor a la carpeta ``vendordeps`` del proyecto. Las bibliotecas de proveedores se pueden actualizar de la misma manera.

source: The ``vendordep`` gradle task can also fetch vendordep JSONs from the user ``wpilib`` folder. To do so, pass ``FRCLOCAL/Filename.json`` as the file URL. For example, ``gradlew vendordep --url=FRCLOCAL/WPILibNewCommands.json`` will fetch the JSON for the new command-based framework.
es_mx: La tarea ``vendordep`` de gradle también puede obtener JSON de vendordep de la carpeta del usuario ``wpilib``. Para hacerlo, pase ``FRCLOCAL/Filename.json`` como el archivo URL. Por ejemplo, ``gradlew vendordep --url=FRCLOCAL/WPILibNewCommands.json`` buscará el JSON para el nuevo marco basado en comandos.
