Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/debugging-robot-program.po
Languages: tr_tr

source: Debugging a Robot Program
tr_tr: Bir Robot Programında Debugging -Hata Ayıklama

source: Inevitably, a program will not behave in the way we expect it to behave. When this occurs, it becomes necessary to figure out why the program is doing what it is doing, so that we can make it do what we want it to do, instead. Such an undesired program behavior is called a "bug," and this process is called "debugging."
tr_tr: Kaçınılmaz olarak, bir program beklediğimiz şekilde davranmayabilir. Bu gerçekleştiğinde, programın bunu neden yaptığını yaptığını anlamamız gerekir, böylece yapmasını istediğimiz şeyi yapmasını sağlayabiliriz. Bu tür istenmeyen program davranışına "bug" hata adı verilir ve düzeltme işlemine "debugging" hata ayıklama denir.

source: A debugger is a tool used to control program flow and monitor variables in order to assist in debugging a program. This section will describe how to set up a debug session for an FRC robot program.
tr_tr: Debugger -hata ayıklayıcı, bir programda hata ayıklamaya yardımcı olurken program akışını kontrol etmek ve değişkenleri izlemek için kullanılan bir araçtır. Bu bölüm, bir FRC robot programı için bir hata ayıklama oturumunun nasıl ayarlanacağını açıklayacaktır.

source: For beginning users who need to debug their programs but do not know/have time to learn how to use a debugger, it is often possible to debug a program simply by printing the relevant program state to the console. However, it is strongly recommended that students eventually learn to use a debugger.
tr_tr: Programlarında hata ayıklaması gereken, ancak bir hata ayıklayıcının -debugger nasıl kullanılacağını bilmeyen/öğrenmeye vakti olmayan yeni başlayan kullanıcılar için, genellikle, yalnızca ilgili program durumunu konsola yazdırarak bir programda hata ayıklamak mümkündür. Ancak, öğrencilerin sonunda bir hata ayıklayıcı-debugger kullanmayı öğrenmeleri şiddetle tavsiye edilir.

source: Breakpoints
tr_tr: Breakpoints-Duraksatma Noktaları

source: A "breakpoint" is a line of code at which the debugger will stop the program execution so that the user can examine the program state. This is extremely useful while debugging, as it allows the user to pause the program at specific points in problematic code to determine where exactly the program is deviating from the expected behavior.
tr_tr: "Breakpoint" Duraksatma Noktası, kullanıcının program durumunu inceleyebilmesi için hata ayıklayıcının programı yürütmeyi durduracağı bir kod satırıdır. Bu, kullanıcının programın beklenen davranıştan tam olarak nerede saptığını belirlemek için, sorunlu koddaki belirli noktalarda programı duraklatmasına izin verdiğinden hata ayıklama sırasında son derece yararlıdır.

source: Setting a Breakpoint
tr_tr: Breakpoint-Duraksatma Noktası Belirleme

source: |Setting a Breakpoint|
tr_tr: |Breakpoint -Duraksatma Noktası Belirleme|

source: Double-click in the left margin of the source code window to set a breakpoint in your user program: A small red circle indicates the breakpoint has been set on the corresponding line.
tr_tr: Kullanıcı programınızda bir breakpoint-duraksatma noktası ayarlamak için kaynak kodu penceresinin sol kenar boşluğunu çift tıklayın: Küçük kırmızı bir daire, ilgili satırda duraksatma noktasının ayarlandığını gösterir.

source: Viewing Program State
tr_tr: Program Durumunu Görüntüleme

source: |Debug Tab|
tr_tr: |Debug-Hata Ayıklama Sekmesi|

source: When the program is stopped at a breakpoint, various pieces of program state can be viewed from the debug tab. The Debug tab is accessed by clicking on the debug icon on the far left pane. Within the debug tab, the program state can be viewed from an assortment of "panes."
tr_tr: Program bir duraksatma noktasında durdurulduğunda, çeşitli program durumları debug sekmesinden görüntülenebilir. Debug sekmesine en soldaki bölmedeki debug simgesine tıklayarak erişilir. Debug sekmesinde, program durumu çeşitli "bölmelerden" görüntülenebilir.

source: The Variables Pane
tr_tr: Değişkenler Bölmesi

source: |Variables Pane|
tr_tr: |Değişkenler Bölmesi|

source: The Variables view shows the current values of variables. To see a variable that is not displayed, select the “Watch” pane and enter the variable name. This will show the variable’s value if it’s in-scope. Clicking on the arrows next to a variable name will expand the tree and show its `fields <https://en.wikipedia.org/wiki/Field_(computer_science)>`__.
tr_tr: Değişkenler görünümü, değişkenlerin mevcut değerlerini gösterir. Gösterilmeyen bir değişkeni görmek için, "Watch-İzleme" bölmesini seçin ve değişken adını girin. Bu, kapsam dahilinde ise değişkenin değerini gösterecektir. Bir değişken adının yanındaki oklara tıklamak, ağacı genişletecek ve onun `alanlar <https://en.wikipedia.org/wiki/Field_(computer_science)>`__'ını gösterecektir.

source: Watch Pane
tr_tr: Watch -İzleme Bölmesi

source: |Watch Pane|
tr_tr: |Watch-İzleme Bölmesi|

source: The Watch Pane can be used to monitor specific variables or expressions while debugging. To add an expression, right-click and select Add Expression.
tr_tr: İzleme Bölmesi, debugging sırasında belirli değişkenleri veya ifadeleri izlemek için kullanılabilir. İfade eklemek için sağ tıklayın ve Add Expression -ifade ekle seçin.

source: Call Stack
tr_tr: Call Stack-Çağrı Yığını

source: |Call Stack|
tr_tr: |Call Stack-Çağrı Yığını|

source: The Call Stack pane is used to display the current `call stack <https://en.wikipedia.org/wiki/Call_stack>`__ of the running program. This can be used to monitor the current call hierarchy of the program while debugging.
tr_tr: Çağrı Yığını bölmesi, çalışan programın geçerli `çağrı yığınını <https://en.wikipedia.org/wiki/Call_stack>`__ görüntülemek için kullanılır. Bu, debugging sırasında programın mevcut çağrı hiyerarşisini izlemek için kullanılabilir.

source: Breakpoint Pane
tr_tr: Breakpoint -Duraksatma Noktası Bölmesi

source: |Breakpoint Pane|
tr_tr: |Breakpoint-Duraksatma Noktası Bölmesi|

source: The Breakpoint Pane displays all of the current breakpoints. To temporarily disable a breakpoint without permanently removing it, click the corresponding checkbox.
tr_tr: Breakpoint Bölmesi, tüm geçerli duraksatma noktalarını görüntüler. Bir duraksatma noktasını kalıcı olarak kaldırmadan geçici olarak devre dışı bırakmak için, ilgili onay kutusunu tıklayın.

source: Running the Debugger
tr_tr: Hata Ayıklayıcıyı Çalıştırma

source: |Start Debugging|
tr_tr: |Debugging'e Başla|

source: Press Ctrl+Shift+P and type WPILib or click on the WPILib Menu item to open the Command palette with WPILib pre-populated. Type Debug and select the Debug Robot Code menu item to start debugging. The code will download to the roboRIO and begin debugging.
tr_tr: Ctrl+Shift+P tuşlarına basın ve WPILib yazın veya WPILib önceden doldurulmuş Komut paletini açmak için WPILib Menü öğesini tıklayın. Hata ayıklamayı başlatmak için Debug yazın ve Debug Robot Code-Robot Kodunda Hata Ayıkla menü öğesini seçin. Kod roboRIO'ya indirilecek ve hata ayıklamaya başlayacaktır.

source: The debugger will automatically pause at the first breakpoint it encounters. The user can then tell the debugger when to proceed to the next breakpoint.
tr_tr: Hata ayıklayıcı, karşılaştığı ilk duraksatma noktasında otomatik olarak durur. Kullanıcı daha sonra hata ayıklayıcıya bir sonraki duraksatma noktasına ne zaman devam edeceğini söyleyebilir.

source: Debugging with Console
tr_tr: Konsoldan Hata Ayıklama

source: Another way to debug your program is to use System.out.println statements in your code and receive them using the RioLog in Visual Studio Code.
tr_tr: Programınızda hata ayıklamanın diğer bir yolu, kodunuzda System.out.println ifadelerini kullanmak ve bunları Visual Studio Code'daki RioLog'u kullanarak sonuç almaktır.
