Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/state-space/state-space-pose_state-estimators.po
Languages: es_mx, fr_ca, tr_tr

source: WPILib Pose and State Estimators
es_mx: Estimadores de postura y estado de WPILib
fr_ca: Estimateurs de pose et d'état WPILib
tr_tr: WPILib Poz ve Durum Tahmin Edicileri

source: WPILib includes pose and state estimators for differential, swerve and mecanum drivetrains. These estimators are designed to be drop-in replacements for the existing :ref:`odometry <docs/software/kinematics-and-odometry/index:Kinematics and Odometry>` classes, with added features that utilize an Extended :ref:`Kalman Filter <docs/software/advanced-controls/state-space/state-space-observers:Kalman Filters>` to fuse latency-compensated robot pose estimates with encoder and gyro measurements. These estimators can account for encoder drift and noisy vision data. These estimators can behave identically to their corresponding odometry classes if only ``update`` is called on these estimators.
es_mx: WPILib incluye estimadores de pose y estado para transmisiones diferenciales, de viraje y mecanum. Estos estimadores están diseñados para ser reemplazos directos para las clases existentes de :ref:`odometría <docs/software/kinematics-and-odometry/index:Kinematics and Odometry>`, con características adicionales que utilizan un Extended :ref:`Kalman Filter <docs/software/advanced-controls/state-space/state-space-observers:Kalman Filters>` para fusionar estimaciones de postura de robot compensadas por latencia con mediciones de codificador y giroscopio . Estos estimadores pueden tener en cuenta la desviación del codificador y los datos de visión ruidosos. Estos estimadores pueden comportarse de manera idéntica a sus clases de odometría correspondientes si solo se llama a "actualizar" en estos estimadores.
fr_ca: WPILib comprend des estimateurs de pose et d'état pour les transmissions différentielles, déviées et mécaniques. Ces estimateurs sont conçus pour remplacer les classes existantes :ref:`odometry <docs/software/kinematics-and-odometry/index:Kinematics and Odometry>`, avec des fonctionnalités supplémentaires qui utilisent un :ref:`filtre de Kalman <docs/software/advanced-controls/state-space/state-space-observers:Kalman Filters>` pour fusionner les estimations de pose de robot compensées par latence avec des mesures d'encodeur et de gyroscope. Ces estimateurs peuvent tenir compte de la dérive des encodeurs et des données de vision avec bruit. Ces estimateurs peuvent se comporter de manière identique à leurs classes d'odométrie correspondantes si seulement la commande ``update`` est appelée sur ces estimateurs.
tr_tr: WPILib, diferansiyel, sapma ve mekanik aktarma organları için poz ve durum tahmin ediciler içerir. Bu tahmin ediciler, gecikme telafili robot poz tahminlerini kodlayıcı ve cayro ölçümleriyle birleştirmek için Genişletilmiş :ref:`Kalman Filter <docs/software/advanced-controls/state-space/state-space-observers:Kalman Filters>` kullanan ek özelliklere sahip mevcut :ref:`odometry <docs/software/kinematics-and-odometry/index:Kinematics and Odometry>` sınıflarının yerine geçecek şekilde tasarlanmıştır. . Bu tahmin ediciler, kodlayıcı sapmasını ve gürültülü görüş verilerini hesaba katabilir. Bu tahmin ediciler, yalnızca ``update`` çağrılırsa, karşılık gelen odometri sınıflarıyla aynı şekilde davranabilirler.

source: Pose estimators estimate robot position using a state-space system with the states :math:`\begin{bmatrix}x & y & \theta \end{bmatrix}^T`, which can represent robot position as a ``Pose2d``. WPILib includes ``DifferentialDrivePoseEstimator``, ``SwerveDrivePoseEstimator`` and ``MecanumDrivePoseEstimator`` to estimate robot position. In these, users call ``update`` periodically with encoder and gyro measurements (same as the odometry classes) to update the robot's estimated position. When the robot receives measurements of its field-relative position (encoded as a ``Pose2d``) from sensors such as computer vision or V-SLAM, the pose estimator latency-compensates the measurement to accurately estimate robot position.
es_mx: Los estimadores de pose estiman la posición del robot usando un sistema de espacio de estados con los estados :math:`\begin{bmatrix}x & y & \theta \end{bmatrix}^T`, que puede representar la posición del robot como una ``Pose2d`` . WPILib incluye ``DifferentialDrivePoseEstimator``, ``SwerveDrivePoseEstimator`` y ``MecanumDrivePoseEstimator`` para estimar la posición del robot. En estos, los usuarios llaman "actualizar" periódicamente con las mediciones del codificador y del giroscopio (igual que las clases de odometría) para actualizar la posición estimada del robot. Cuando el robot recibe mediciones de su posición relativa al campo (codificada como ``Pose2d``) de sensores como la visión por computadora o V-SLAM, el estimador de pose compensa la latencia de la medición para estimar con precisión la posición del robot.
fr_ca: Les estimateurs de pose estiment la position du robot en utilisant un système d'espace d'états avec les états :math:`\begin{bmatrix}x & y & \theta \end{bmatrix}^T`, qui peut représenter la position du robot sous forme de ``Pose2d``. WPILib inclut ``DifferentialDrivePoseEstimator``, ``SwerveDrivePoseEstimator`` et ``MecanumDrivePoseEstimator`` pour estimer la position du robot. Dans ceux-ci, les utilisateurs appellent périodiquement ``update`` avec les mesures de l'encodeur et du gyroscope (identiques aux classes d'odométrie) pour mettre à jour la position estimée du robot. Lorsque le robot reçoit des mesures de sa position relative au champ (codée en tant que ``Pose2d``) de capteurs tels que la vision par ordinateur ou V-SLAM, l'estimateur de pose compense la latence de la mesure pour estimer avec précision la position du robot.
tr_tr: Poz tahmin edicileri, durum uzay sistemi kullanarak robot konumunu tahmin eder :math:`\begin{bmatrix}x & y & \theta \end{bmatrix}^T`, bu robot konumunu ``Pose2d`` olarak temsil edebilir . WPILib, robot konumunu tahmin etmek için ``DifferentialDrivePoseEstimator``, ``SwerveDrivePoseEstimator`` ve ``MecanumDrivePoseEstimator`` içerir. Bunlarda kullanıcılar, robotun tahmini konumunu güncellemek için periyodik olarak kodlayıcı ve cayro ölçümleriyle (odometri sınıflarıyla aynı) ``update`` çağırır. Robot, bilgisayar görüşü veya V-SLAM gibi sensörlerden alana göre konumunun (` Pose2d`` olarak kodlanmış) ölçümlerini aldığında, poz tahminci gecikmesi, robot konumunu doğru bir şekilde tahmin etmek için ölçümü telafi eder.

source: The pose estimators perform latency compensation by storing a list of past observer states, including estimated state :math:`\mathbf{\hat{x}}`, error covariance :math:`\mathbf{P}`, inputs and local measurements. When new measurements are applied, the state of the estimator is first rolled back to the measurement's timestamp. Then, the filter corrects its state estimate with the new measurement and applies the inputs between the measurement timestamp and the present time to incorporate the new measurement. This allows for vision solutions with framerates which might otherwise make them unusable be a viable solution for robot localization.
es_mx: Los estimadores de pose realizan una compensación de latencia almacenando una lista de estados de observadores pasados, incluido el estado estimado :math:`\mathbf{\hat{x}}`, covarianza de error :math:`\mathbf{P}`, entradas y medidas locales . Cuando se aplican nuevas mediciones, el estado del estimador primero se retrae a la marca de tiempo de la medición. Luego, el filtro corrige su estimación de estado con la nueva medición y aplica las entradas entre la marca de tiempo de la medición y el tiempo actual para incorporar la nueva medición. Esto permite que las soluciones de visión con velocidades de fotogramas que de otro modo las inutilicen sean una solución viable para la localización de robots.
fr_ca: Les estimateurs de pose effectuent une compensation de latence en stockant une liste des états d'observateurs passés, y compris l'état estimé :math:`\mathbf{\hat{x}}`, la covariance d'erreur :math:`\mathbf{P}`, les entrées et les mesures locales . Lorsque de nouvelles mesures sont appliquées, l'état de l'estimateur est d'abord restauré à l'horodatage de la mesure. Ensuite, le filtre corrige son estimation d'état avec la nouvelle mesure et applique les entrées entre l'horodatage de la mesure et l'instant présent pour incorporer la nouvelle mesure. Cela permet des solutions de vision avec des fréquences d'images qui pourraient autrement les rendre inutilisables, ce qui constitue une solution viable pour la localisation de robots.
tr_tr: Poz tahmin edicileri, tahmini durum :math:`\mathbf{\hat{x}}`, hata kovaryansı :math:`\mathbf{P}`, girdiler ve yerel ölçümler dahil olmak üzere geçmiş gözlemci durumlarının bir listesini depolayarak gecikme telafisi gerçekleştirir. Yeni ölçümler uygulandığında, tahmin edicinin durumu ilk olarak ölçümün zaman damgasına geri döndürülür. Daha sonra filtre, durum tahminini yeni ölçümle düzeltir ve yeni ölçümü dahil etmek için ölçüm zaman damgası ile şimdiki zaman arasındaki girdileri uygular. Bu, aksi takdirde onları kullanılamaz hale getirebilecek ve robot yerelleştirmesi için uygun bir çözüm haline gelebilecek çerçeve hızlarına sahip görüntü işleme çözümlerine olanak tanır.

source: The following example shows the use of the ``DifferentialDrivePoseEstimator``:
es_mx: El siguiente ejemplo muestra el uso del ``DifferentialDrivePoseEstimator``:
fr_ca: L'exemple suivant montre l'utilisation du ``DifferentialDrivePoseEstimator``:
tr_tr: Aşağıdaki örnek, ``DifferentialDrivePoseEstimator`` kullanımını gösterir:

source: Tuning Pose Estimators
es_mx: Estimadores de pose de afinación
fr_ca: Réglage des estimateurs de pose
tr_tr: Poz Tahmincilerini Ayarlama

source: All pose estimators offer user-customizable standard deviations for model and measurements. These standard deviations determine how much the filter "trusts" each of these states. For example, increasing the standard deviation for measurements (as one might do for a noisy signal) would lead to the estimator trusting its state estimate more than the incoming measurements. On the field, this might mean that the filter can reject noisy vision data well, at the cost of being slow to correct for model deviations. While these values can be estimated beforehand, they very much depend on the unique setup of each robot and global measurement method.
es_mx: Todos los estimadores de pose ofrecen desviaciones estándar personalizables por el usuario para el modelo y las medidas. Estas desviaciones estándar determinan cuánto "confía" el filtro en cada uno de estos estados. Por ejemplo, aumentar la desviación estándar para las mediciones (como se podría hacer para una señal ruidosa) haría que el estimador confiara en su estimación de estado más que en las mediciones entrantes. En el campo, esto podría significar que el filtro puede rechazar bien los datos de visión ruidosos, a costa de ser lento para corregir las desviaciones del modelo. Si bien estos valores se pueden estimar de antemano, dependen en gran medida de la configuración única de cada robot y del método de medición global.
fr_ca: Tous les estimateurs de pose offrent des écarts-types personnalisables par l'utilisateur pour le modèle et les mesures. Ces écarts types déterminent dans quelle mesure le filtre "se conforme" à chacun de ces états. Par exemple, augmenter l'écart type pour les mesures (comme on pourrait le faire pour un signal bruyant) conduirait l'estimateur à faire davantage confiance à son estimation d'état qu'aux mesures entrantes. Sur le terrain, cela pourrait signifier que le filtre peut bien rejeter les données de vision bruyantes, au prix d'une lenteur à corriger les écarts du modèle. Bien que ces valeurs puissent être estimées à l'avance, elles dépendent beaucoup de la configuration unique de chaque robot et de la méthode de mesure globale.
tr_tr: Tüm poz tahmin edicileri, model ve ölçümler için kullanıcı tarafından özelleştirilebilir standart sapmalar sunar. Bu standart sapmalar, filtrenin bu durumların her birine ne kadar "güvendiğini" belirler. Örneğin, ölçümler için standart sapmanın arttırılması (gürültülü bir sinyal için yapılabileceği gibi), tahmin edicinin kendi durum tahminine gelen ölçümlerden daha fazla güvenmesine yol açacaktır. Sahada bu, filtrenin model sapmalarını yavaş yavaş düzeltmek pahasına gürültülü görüş verilerini iyi bir şekilde reddedebileceği anlamına gelebilir. Bu değerler önceden tahmin edilebilirken, bunlar büyük ölçüde her robotun benzersiz kurulumuna ve genel ölçüm yöntemine bağlıdır.

source: The Differential Drive State Estimator
es_mx: El estimador de estado de transmisión diferencial
fr_ca: L'estimateur d'état pour une base pilotable différentielle
tr_tr: Diferansiyel Sürüş Durum Tahmincisi

source: The ``DifferentialDriveStateEstimator`` (C++/Java) is a more advanced estimator, which includes u-error estimation and encoder distance measurements to more accurately estimate robot position. U-error can account for unmodeled dynamics by estimating the voltage being lost to wheel drag or scrub. The ``DifferentialDriveStateEstimator`` uses a system with the states :math:`\begin{bmatrix} x & y & \theta & \text{vel}_l & \text{vel}_r & \text{dist}_l & \text{dist}_r & \text{voltError}_l & \text{voltError}_r & \text{headingError} \end{bmatrix}^T`, outputs left and right voltages, and can take inputs from either vision (as :math:`\begin{bmatrix}x & y & \theta \end{bmatrix}^T`) or encoders and gyros (as :math:`\begin{bmatrix} \text{dist}_l & \text{dist}_r & \theta \end{bmatrix}^T`).
es_mx: El ``DifferentialDriveStateEstimator`` (C ++ / Java) es un estimador más avanzado, que incluye estimación de error U y mediciones de distancia del codificador para estimar con mayor precisión la posición del robot. El error U puede explicar la dinámica no modelada estimando el voltaje que se pierde por el arrastre o fregado de las ruedas. El ``DifferentialDriveStateEstimator`` usa un sistema con los estados :math:`\begin{bmatrix} x & y & \theta & \text{vel}_l & \text{vel}_r & \text{dist}_l & \text{dist}_r & \text{voltError}_l & \text{voltError}_r & \text{headingError} \end{bmatrix}^T`, genera voltajes izquierdo y derecho, y puede tomar entradas de cualquier visión (como :math:`\begin{bmatrix}x & y & \theta \end{bmatrix}^T`) o codificadores y giroscopios (como :math:`\begin{bmatrix} \text{dist}_l & \text{dist}_r & \theta \end{bmatrix}^T`).
fr_ca: Le ``DifferentialDriveStateEstimator`` (C++/Java) est un estimateur plus avancé, qui comprend une estimation de l'erreur u et des mesures de distance des encodeurs pour estimer plus précisément la position du robot. L'erreur U peut expliquer une dynamique sans modèle en estimant la perte de tension en raison de la traînée ou du frottement des roues. Le ``DifferentialDriveStateEstimator`` utilise un système avec les états :math:`\begin{bmatrix} x & y & \theta & \text{vel}_l & \text{vel}_r & \text{dist}_l & \text{dist}_r & \text{voltError}_l & \text{voltError}_r & \text{headingError} \end{bmatrix}^T`, qui génèrent des tensions gauche et droite, et peut prendre des entrées de l'une ou l'autre source de vision (comme :math:`\begin{bmatrix}x & y & \theta \end{bmatrix}^T`) ou des encodeurs et gyroscopes (comme :math:`\begin{bmatrix} \text{dist}_l & \text{dist}_r & \theta \end{bmatrix}^T`).
tr_tr: ``DifferentialDriveStateEstimator`` (C ++ / Java), robot konumunu daha doğru bir şekilde tahmin etmek için u-error tahmini ve kodlayıcı mesafe ölçümlerini içeren daha gelişmiş bir tahmincidir. U hatası, tekerlek sürüklemesi veya itilmeye bağlı olarak kaybedilen voltajı tahmin ederek modellenmemiş dinamikleri açıklayabilir. ``DifferentialDriveStateEstimator`` şu durumlara-states sahip bir sistem kullanır :math:`\begin{bmatrix} x & y & \theta & \text{vel}_l & \text{vel}_r & \text{dist}_l & \text{dist}_r & \text{voltError}_l & \text{voltError}_r & \text{headingError} \end{bmatrix}^T`,sol ve sağ voltaj çıkışlarını sağlar ve girişleri matematik görüntüden (:math:`\begin{bmatrix}x & y & \theta \end{bmatrix}^T`) veya kodlayıcılar ve jiroskoplar (as :math:`\begin{bmatrix} \text{dist}_l & \text{dist}_r & \theta \end{bmatrix}^T`) dan.

source: For the ``DifferentialDriveStateEstimator``, it is important that the state-space model is accurate to the physical hardware. Characterization using the frc-characterization drivetrain tools to find linear and angular kV and kA, combined with ``LinearSystem``'s ``identifyDrivetrainSystem`` (Java)/``IdentifyDrivetrainSystem`` (C++), is an easy way to accurately create a state-space model of your robot's drivetrain.
es_mx: Para el ``DifferentialDriveStateEstimator``, es importante que el modelo de espacio de estado sea preciso para el hardware físico. La caracterización utilizando las herramientas del tren motriz de caracterización frc para encontrar kV y kA lineales y angulares, combinada con ``LinearSystem`` ``identifyDrivetrainSystem`` (Java)/``IdentifyDrivetrainSystem`` (C++), es una forma fácil de crear un modelo de espacio de estado de la transmisión de su robot.
fr_ca: Pour le ``DifferentialDriveStateEstimator``, il est important que le modèle d'espace-état soit précis par rapport au carastéristiques physiques du robot. La caractérisation à l'aide des outils de caractérisation FRC pour la base pilotable afin de trouver des kV et kA linéaires et angulaires, combinée avec le système ``identifyDrivetrainSystem`` (Java)/``IdentifyDrivetrainSystem`` (C++), est un moyen facile pour créer un modèle d'espace-état de votre robot.
tr_tr: ``DifferentialDriveStateEstimator`` için, durum-uzay modelinin fiziksel donanım için doğru olması önemlidir. Doğrusal ve açısal kV ve kA'yı bulmak için frc-characterization drivetrain tools araçlarını kullanarak, ``LinearSystem`` in ``identifyDrivetrainSystem''(Java)/``IdentifyDrivetrainSystem`` (C++) ile birlikte, doğru bir şekilde Robotunuzun aktarma organlarının durum uzay modelini oluşturun.
