Repository: AustinShalit/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/controls-overviews/control-system-software.po
Languages: es_mx

source: The FRC Radio Configuration Utility is a tool used to configure the the OpenMesh OM5P-AN or OM5P-AC radio for practice use at home. This tool sets the appropriate IP, and network settings for proper network connection, as well as the QOS settings required to mimic the bandwidth limiting and packet prioritization experience on the FRC playing field. The FRC Radio Configuration Utility is installed by a standalone installer, instructions on installing and using the FRC Radio Configuration Utility to configure your radio can be found :ref:`here <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`.
es_mx: La FRC Radio Configuration Utility es una herramienta que se utiliza para configurar la radio OpenMesh OM5P-AN o OM5P-AC para uso práctico en casa. Esta herramienta establece la IP apropiada y la configuración de red para una conexión de red adecuada, así como la configuración de QOS requerida para imitar la experiencia de limitación de ancho de banda y priorización de paquetes en el campo de juego de FRC. La Utilidad de Configuración de la radio de FRC es instalada por un instalador único, las instrucciones para instalar y usar la Utilidad de Configuración de la radio de FRC para configurar su radio se pueden encontrar :ref:`aquí <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`.
